<?if ($xing<>"") ?>
  <?include file='common/displayUserInfo.php'?>
  <?if isset($subIncludePage) ?>
      <?include file="$subIncludePage"?>
  <?/if?>
<? else  ?>
  <?include file="common/crackBorder.php" includePage='common/enterAllInfoForm.php' ?>

<table width="100%" border="0" cellspacing="0" cellpadding="0" class="b1" style="table-layout:fixed;word-wrap:break-word;">
  <TBODY>
    <tr>
      <TD class=ttop style="PADDING-BOTTOM: 1px" vAlign=top>算命知识</TD>
    </tr>
    <tr>
      <TD class=new style="PADDING-BOTTOM: 8px" vAlign=top><span class="red">八字:</span>“八字”也叫四柱 （年柱、月柱、日柱、时柱），每柱两个字，上为天干(甲、乙、丙、丁、戊、己、庚、辛、壬、癸)，下为地支(子、丑、寅、卯、辰、巳、午、未、申、酉、戌、亥)，正好八个字，所以称为“八字”，因其原理基于与阴阳五行所以和“紫薇斗数”等统称“五行术”。

相传在黄帝时期，即由天皇氏制干支，伏羲氏作甲历，创建了中国的历法（现在的太阴历）。从黄帝纪元起，到现在已历七十八个花甲。一个花甲六十年，由天干、地支依序排列循环组合而成。<br><span class="red">五格:</span>五格指的是姓名学中天格、地格、人格、总格、外格。

五格剖象法是目前较有影响的一种取名法。最初在公元1918年初，由日本人熊崎健翁开创，因此五格剖象法也称作“熊崎氏姓名学”，其核心就是将人的姓名按五格剖象法来解释。

所谓五格剖象法就是根据《易经》的“象”“数”理论，依据姓名的笔画数和一定的规律建立起的五格数理关系，并运用阴阳五行相生相克的道理，推算人生各方面运势的一种简易方法。对于姓名学的内容，要用辩证的眼光去看，给后代、子女取名时不妨参考；如果自己目前的姓名数理配置不理想，也没有必要去改户口本上的名字，可以用笔名、常用名去补救，原著上说，最常写、常用的名字对自己人生运势的暗示力最大。

五格计算方法： 

1、天格：复姓，合计姓氏之笔画；单姓，再加假添一数。如司马光，司马是复姓，天格是5+10=15；李刚，李是单姓，天格是7+1=8。天格乃祖先留下来的，其数理对人影响不大。 

2、人格，又称"主运"，是整个姓名的中心点，人一生的命运，均由此人格推断。其构成是姓氏最下字与名字最上字笔画数之和。如：刘江，人格数是15+7=22。司马懿，人格数是10+22=32。 

3、地格：由名字全部笔画数构成，称为"前运"，主管人中年以前的活动力。如是单字名，再加假添一数。如司马懿，地格数是22+1=23。刘江海，地格数是7+11=18。 

4、总格：合计姓与名的总笔画数，主中年至晚年的命运，又称"后运"。如司马懿，总格数是5+10+22=37。刘江海，总格数是15+7+11=33。 

5、外格：总格笔画数减去人格笔画数，如是单字名或单姓，再加假添一数。主管命运之灵力。如司马懿，外格数是37-32+1=6。刘江海，外格数是33-22+1=12。 <br><span class="red">称骨算命法:</span>称骨算命法是唐代著名的星象预测家袁天罡称骨的预测方法。这种方法同四柱算命一样，能确定一个人一生的吉凶祸福、荣辱盛衰，准确率很高，又便于掌握和运用。 <BR>
一个人出生的年、月、日、时各有定数，年、月、日、时的重量都有具体规定。只要把年、月、日、时的重量加在一起，按照“称骨歌”一查，就可确定这个人一生的命运。 <BR>
一个人出生的年份按年干支（即甲子年、乙丑年，丙寅年等）来确定重量。出生月按月份（即正月、二月等）来确定重量。出生日按日数（即初一、初二等）确定重量。出生时辰按子、丑、寅、卯、辰、巳、午、未、申、酉、戌、亥十二时辰确定重量。 <BR>
现代的每二个小时是古代的一个时辰。 <BR>
十二时辰换算成现代的钟点，就是： <BR>
子时——晚11点钟到凌晨1点钟； <BR>
丑时——1点钟至3点钟； <BR>
寅时——3点钟至5点钟； <BR>
卯辰——5点钟至7点钟； <BR>
辰时——7点钟至9点钟； <BR>
巳时——9点钟至11点钟； <BR>
未时——下午1点钟至3点钟； <BR>
申时——下午3点钟至5点钟； <BR>
酉时——下午5点钟至7点钟； <BR>
戌时——下午7点钟至晚9点钟； <BR>
亥时——晚9点钟至11点钟。 <BR>
例：一人出生在甲子年正月初一日子时 <BR>
甲子年骨重一两二钱 <BR>
正月骨重六钱 <BR>
初一日骨重五钱 <BR>
子时骨重一两六钱 <BR>
年、月、日、时骨重加在一起（1.2+0.6+0.5+1.6=3.9），此人总骨重是三两九钱。查看三两九钱的“称骨歌”，就是这个人一生的命运</TD>
    </tr>
  </TBODY>
</TABLE>
<?/if?>