-- phpMyAdmin SQL Dump
-- version 2.10.3
-- http://www.phpmyadmin.net
-- 
-- 主机: localhost:3308
-- 生成日期: 2009 年 07 月 28 日 09:17
-- 服务器版本: 5.0.51
-- PHP 版本: 5.2.6

SET SQL_MODE="NO_AUTO_VALUE_ON_ZERO";

-- 
-- 数据库: `ming`
-- 

-- --------------------------------------------------------

-- 
-- 表的结构 `huangdaxian`
-- 

CREATE TABLE `huangdaxian` (
  `id` int(11) NOT NULL auto_increment,
  `qianshu` varchar(50) default NULL,
  `name` varchar(50) default NULL,
  `title` varchar(255) default NULL,
  `shi` varchar(255) default NULL,
  `content` longtext,
  PRIMARY KEY  (`id`),
  KEY `id` (`id`)
) ENGINE=MyISAM  DEFAULT CHARSET=utf8 AUTO_INCREMENT=101 ;

-- 
-- 导出表中的数据 `huangdaxian`
-- 

INSERT INTO `huangdaxian` VALUES (1, '第一枝', '上上', '龙虎渡姜公', '灵韱求得第一枝龙虎风云际会时一旦凌霄扬自乐任君来往赴瑶池', '周朝兴国功臣，姜太公，又名尚，当时龙虎得风云会合，则龙飞到上天去，扬扬快乐，即瑶池仙家地方，亦可到矣，此是荣华发达之象也，求得此签者，定百事如意，真第一枝上签也');
INSERT INTO `huangdaxian` VALUES (2, '第二枝', '上吉', '王道真误入桃源', '枯木逢春尽发新花香叶茂蝶来频桃源竞斗千红紫一叶渔舟误入津', '枯木遇春天而发新意，花香叶茂蝴蝶频来，桃源乃仙家地方，其桃花放得千红万紫，时王道真撑艇入此水道游玩，此乃繁华快乐之象也，求得此签者，必有意外奇逢，极甚快活矣，但需无心得之，不可着意以求，此签吉而无凶，谋事顺遂');
INSERT INTO `huangdaxian` VALUES (3, '第三枝', '中平', '鲁班训迪', '牛山之木皆常美独惜斧工尽伐他大器大材无足用规矩不准怎为槎', '牛山之木常属佳，斧头之人，尽斩伐之，虽有大件木材，亦无实用，因此木不合规矩，难以做木筏之用也，求此签者，宜将一切不良嗜好，均要节戒，勿为小人攻伐其短处，要循规蹈矩，今所行不善，不依规矩，终归无用，真可惜矣，此吉中而有凶，凡得此签，须要防范小人侵害');
INSERT INTO `huangdaxian` VALUES (4, '第四枝', '中吉', '调雏紫燕正穿梭', '调雏紫燕在檐前对语呢喃近午天或往或来低复起有时剪破绿杨烟', '燕教小燕子学讲话，在檐口对语，往来飞舞，亦一乐也，但往而复来，低而复起，似无定景象，然平稳而无碍，求得此签者，凡事亦不宜太忧心，但要防是非口舌');
INSERT INTO `huangdaxian` VALUES (5, '第五枝', '中吉', '韩夫人惜花', '东园昨夜狂风急万紫千红亦尽倾幸有惜花人早起培回根本复栽生', '狂风太急，吹得，花倾侧，此惊险之象也，幸有爱惜花者，培回根本，而花复生，此乃有贵人扶助之象也，论，签，险中而有救，但须要自己立即修善，有以感动人心，才有贵人扶救，而化凶为吉也，有幸字，不易得此贵人也，而凶中有吉之签，要防小人之是非口舌。');
INSERT INTO `huangdaxian` VALUES (6, '第六枝', '上吉', '王羲之归故里', '一片孤帆万里回管弦呕哑且停杯如云胜友谈风月畅叙幽情极乐哉', '晋朝时代，书法，家姓王名羲之，当时在万里远处回家，常吹箫弹琴饮酒，许多朋友相聚谈风说月，心情欢欣之极，求得此签者，百事皆吉');
INSERT INTO `huangdaxian` VALUES (7, '第七枝', '中吉', '人贵归家', '秋来征雁向南归红叶纷纷满院飞碪捣城头声切耳江枫如火在渔矶', '唐朝时代，薛仁，征东，得胜回朝封王而归家，当时秋将冷，雁南飞，红叶凋谢，人洗寒衣，此秋天冷落之景，，无防碍之处，亦无快活之气也，得此签者，凡事宜慎预防，则平安矣');
INSERT INTO `huangdaxian` VALUES (8, '第八枝', '下下', '鸠占鹊巢', '鸣鸠争夺鹊巢居宾主参差意不舒满岭乔松萝茑附且猜诗语是何如', '鹊有巢而为鸠所夺，两家不舒畅，山有松树而被藤萝周身牵缠，等于人而被人欺凌，即依附于人之象，如求，此签者，凡事宜隐忍勿强争夺，诚恐为是非而拖累，难以解脱而要依附于人也，此乃凶多而少之象，宜防小人口舌，宜在社坛作福，祭朱雀方吉');
INSERT INTO `huangdaxian` VALUES (9, '第九枝', '上吉', '陶渊明赏菊', '瑶琴一曲奏新腔明月清风枕簟凉咸集嘉宾同赏菊或歌或舞或飞觞', '明月清风，枕席爽，陶渊明会集许多朋友来赏菊花，弹琴唱歌饮酒，此乃快活之景象也，如求得此签者，所，各事皆顺利，无往而不利矣');
INSERT INTO `huangdaxian` VALUES (10, '第十枝', '中平', '苏秦不第', '一轮月镜挂空中偶被浮云障迭月玉匣何时光气吐谁人借我一狂风', '战国时代苏秦，屡试不第，仍然不屈不挠，卒为六国之宰相，有如月镜挂天中，偶被浮云，重遮盖，此暂时轻，遭劫之象，要人借我以风吹散浮云，而现下未知何人可借，是未得贵人，助也，求得此签者，隐忍待时，不可妄动，防避小人口舌，不久即有贵人相扶，消此小劫，乃吉中微有凶之签');
INSERT INTO `huangdaxian` VALUES (11, '第十一枝', '上吉', '汉文帝赏柳', '杨柳垂堤锁绿烟日长三起又三眠往来紫燕纷飞舞袅娜迎风倩我怜', '汉文帝生平最为酷爱杨柳，每日在于政暇时，及杨柳垂堤之时，日中常常三起三眠，以欣赏其秀茂景色，盖杨柳有时垂有时起，且有燕子往来飞舞其间，迎风摇动，景色怡人，此乃心欢快乐之景象也，求得此签者，求谋顺遂事事皆吉');
INSERT INTO `huangdaxian` VALUES (12, '第十二枝', '下下', '太白捞', '蜃楼海市幻无边万丈擎空接上天或被狂风忽吹散有时仍聚结青烟', '海中蜃蛤吐气如楼，高接到天，一有风来，便吹散矣，虽散而复聚，亦如烟之浮，不能长久也，此乃一片虚浮景象，跟前虽好，实无归结，求得此签者，当行善以为根本，则可坚稳长久，事事不被人吹散矣，此签凶多吉少，要防小人口舌，宜在当天作福吉');
INSERT INTO `huangdaxian` VALUES (13, '第十三枝', '中平', '孟浩然寻梅', '岭南初放一枝梅片片晶莹入酒杯郄遇骑驴人早至儿意背负占春魁', '岭南梅开最早，将花入酒杯，饮之甚香，遇有骑驴者，寄此梅花于人，百花来开而此花独占先开，亦令人必悦也，求得此签者，遇有贵人带引，则事事如意矣，此签半吉半凶，该签虽无大碍之句，而似有被人占以先手之象，则逢吉变凶矣，解签者要细思之');
INSERT INTO `huangdaxian` VALUES (14, '第十四枝', '中吉', '东坡归隐', '为爱幽闲多种竹买春赏雨在茅屋醉时卧倒杏花边怕听莺儿惊梦熟', '苏东坡辞官归里家园，多种竹树，买春赏雨，醉卧杏花之边，此安乐之景，怕有莺儿惊梦，此惊慌之象于安乐中，防避口舌，常在一点善心，亦无碍也，读一怕字，要慎防则吉');
INSERT INTO `huangdaxian` VALUES (15, '第十五枝', '上吉', '明皇游月殿', '仙槎一叶泛中流月殿蟾宫任尔游盈耳霓裳声暂歇酒诗吟饮几时休', '唐明皇时，国泰民安，优游安乐，故此有风流天子之称，因他素慕月殿蟾宫之美丽，时欲想往一游，卒得一叶仙舟，载赴月殿，任其游乐，学得霓裳仙子羽衣曲而回，歌歌唱唱饮酒吟诗，快乐不歇，此快乐之景象，求得此签者，万事皆吉，无碍，可称为心想事成也');
INSERT INTO `huangdaxian` VALUES (16, '第十六枝', '中吉', '牧童跨犊回归', '天边鸦背夕阳回陇外儿童跨犊来羌笛频吹声切耳短长腔调乐何哉', '日落山冈时候，天边之鸦鹊归巢，郊外的牧牛童子，亦骑牛而归家，一路上吹得竹笛之声充满耳，此童子甚快乐也，此签有快乐之意，则凡事平稳无碍，不用忧心矣');
INSERT INTO `huangdaxian` VALUES (17, '第十七枝', '中吉', '月下追贤', '秋水蒹葭白露盈盈庭月色浸阶清清风吹动马铃响响接晨钟不断声', '秋天多露，月色满阶，风吹马铃，响接晨钟之声，此乃汉时韩信，投奔汉高祖，未获重用，夤夜驰归，为张良所知，告信之能于高祖，乃月下追回韩信时之情景也，求得此签，凡事皆平稳，虽或阻滞，到底必好，有吉而无凶');
INSERT INTO `huangdaxian` VALUES (18, '第十八枝', '下吉', '杜鹃泣血动客心', '杜鹃啼血泪悲声声怨霜寒梦乍惊惊动异乡为异客客心更触故园情', '春末夏初之时，杜鹃雀啼，声声悲而且凄切，如怨如慕，如泣如诉，留落异地作他乡客，闻声触感，每动思家之心情，乃一种愁闷之气象，求得此签者，凡事务须留心谨慎，且要修善，方能消灾除祸，便逢凶化吉，更宜防小人口舌是非，要在当天作福吉');
INSERT INTO `huangdaxian` VALUES (19, '第十九枝', '中吉', '伏羲画八卦', '干卦三连号太阳潜龙勿用第一章其中爻象能参透百福骈臻大吉昌', '干卦纯阳无阴，能想透第一章之句语，隐藏其刚强之气勿用，则百福至而大吉昌矣，求得此签者，凡事要隐忍退避，静以待时，有善气而无恶气，方能受福而吉昌也，此签有吉无凶，平稳无碍');
INSERT INTO `huangdaxian` VALUES (20, '第二十枝', '中平', '雪梅招亲', '天上仙花难问种人间尘事几多更前程已注公私簿罚赏分明浊与清', '雪梅为安南国王之宫主，特征联求婚，其联首曰，太极殿前三尺雪，后有广东人姓黄名华贵，当时福至心灵，以梅之得植于人间，原出于天上仙花之种，乃以广寒宫里一枝梅，为联比以应征，卒获招为驸马，论此签意，凡事平稳，倘能力行善事，当可获福也');
INSERT INTO `huangdaxian` VALUES (21, '第二十一枝', '中吉', '武则天赏花', '天外红霞如抹锦槛边桃杏斗新妆盈眸烟熳谁居首美酒频斟且酌量', '此为唐时武则天，于冬天击鼓摧花时，评桃品杏之情景也，求得此签者，凡事有吉无凶，井且定必有意外财收获也，若问自身之事，更可丁财两发，诸事平稳之象也');
INSERT INTO `huangdaxian` VALUES (22, '第二十二枝', '下下', '陈妙常思春', '秋水依人各一方天南地北恨偏长相思试问凭谁寄不尽凄凉狂断肠', '天南地北，各居一方，书信又无人寄，思念到肝肠都断，此乃凄凉之景象也，求得此签者，要修善以感动人心，则凡事有贵人，又可寄托，免至凄凉也，此签凶事多而吉少，宜社坛作福');
INSERT INTO `huangdaxian` VALUES (23, '第二十三枝', '中平', '邯郸幻梦', '邯郸一梦幻无边数载身荣是熟眠换郄锦衣归故里睡醒还记在心田', '梦中得富贵，着锦绣衣裳回家，醒后仍然记在心中，此乃一片虚假之情形，此签虽无防碍，但亦无可取之处也，若求得此签者，宜凡事谨慎');
INSERT INTO `huangdaxian` VALUES (24, '第二十四枝', '下下', '白居易叹情', '诗酒琴棋可解愁座中无客乐难休或弹或唱谁知美冷饮虽多亦是忧', '诗酒琴棋，可以解人愁闷，苦无人客知己，独自弹琴唱歌，优点无人得知，如此冷淡，虽然多饮几杯闷酒，仍然是忧也，而求得此签者，虽处于顺境，而未免有忧愁，急宜广结善缘，务使善与人同，则应求多而无忧愁矣，盖此签凶多而吉少，宜在社坛作福吉');
INSERT INTO `huangdaxian` VALUES (25, '第二十五枝', '上吉', '朱洪武登基', '群山扰扰朝中岳有似为臣列鹄班拱立两行齐整肃自居此地岂无欢', '天下之山以中岳为至高，四山朝拱，齐整如人臣拱手排班而立，居此地者，有如君之使臣，一呼即应，明朝开国之君，朱元璋，少时牧牛时，率群童登中岳之巅，戏称自己为帝，使群贺之，后朱元璋竟成真正皇帝，号称洪武，统一山河，若求得此签者，必得事事如意，步步高陛也');
INSERT INTO `huangdaxian` VALUES (26, '第二十六枝', '中平', '徐庶归家', '花影迟迟侵砌上遥知月镜挂长空忽闻鹤泪声凄切早买归舟返里中', '花影侵于花基上，知系月镜排在空中，忽闻鹤声啼得悲切，即要买舟回家，此签大意，言人当要知机，一闻不吉之消息，如闻鹤声之凄切，要及早回头，归于善路，方有结果，如行客之买舟回家一般，此签于吉中有凶，但逢凶亦可以化吉，知趋避便无碍，宜防小人是非口舌');
INSERT INTO `huangdaxian` VALUES (27, '第二十七枝', '中平', '蝶蚁知时', '天晴粉蜨翻衣晒又看庭前蚁阵排队伍整齐趋或退时开时合思何佳', '天晴则蝶晒其翼，将雨则蚁出如摆阵，或进或退，时开时合，在蚁子亦甚得意矣，人与物同，各得其意，便是快活，求得此签者，亦平稳无碍也');
INSERT INTO `huangdaxian` VALUES (28, '第二十八枝', '中平', '浔阳江听琵琶', '船泊浔阳月夜天琵琶一曲动人怜相思两地凭谁寄白雪摧人上鬓巅', '古人白司马，当时被贬闲居，在浔阳江上听琵琶，此非快活之景，两地相思，无人寄信，白发又催人老，此更冷淡，求得此签者，虽无大碍，亦无欢喜之处，凡事亦凶多而吉少也');
INSERT INTO `huangdaxian` VALUES (29, '第二十九枝', '中吉', '张翰思鲈', '鲈鱼作脍菊花黄美酒盈樽近晚凉泛掉正当潮上候这般佳景乐无央', '好鱼生，好菊花，好酒，好天时，好潮水， 在水面快活之景，件件俱全，其乐无穷尽矣，求得此签者，凡事平稳无碍，是安乐也，此签亦拟上吉，与第九枝语意一般耳，快活景象，彼此相同');
INSERT INTO `huangdaxian` VALUES (30, '第三十枝', '下下', '马嵬坡勒死杨贵妃', '倾国倾城媚百生六宫粉黛尽无名马嵬山下魂飞去至令明皇长恨情', '唐明皇专宠爱杨贵妃，六宫美女尽不钟意，及安禄山作反，出兵征之，，，马嵬坡，三军不行，要皇将杨贵妃斩首，至肯前进，于是贵妃死在马嵬坡下，而魂飞天上也，，明皇日日长恨之，此签有凶无吉，求得此签者，凡事要谨慎，更宜防小人口舌，且必先恶从，，能化凶为吉，宜观音作福');
INSERT INTO `huangdaxian` VALUES (31, '第三十一枝', '下下', '蔡中兴遇险', '狂风骤雨打船篷溪畔桃花尽落红惊醒渔翁春梦熟持篙撑去失西东', '狂风急雨，打落桃花，大雨打落船篷，惊醒鱼翁，此有险之象，竹篙撑艇，不知西东，此彷徨昏迷之象，而求得此签者，恐有惊险之事，此时手忙脚乱，亦甚难做作，务要急收善果，以植种福基，而遇事有贵人指引，免至迷懵不知西东也，此签凶多而吉少，要防小人口舌，宜在海龙王作福');
INSERT INTO `huangdaxian` VALUES (32, '第三十二枝', '中平', '苏武牧羊', '十九年前海上辛节旄雕败逐沙尘餐毛嚼雪谁怜我惟有羊儿作伴群', '古人姓苏名武，受困于番邦地方，在海上看羊十九年，天寒无饭食，以毛毯包雪食之，而无人可怜，惟羊仔陪伴，此乃凄凉之景象，求得此签者，必要立心忠直，隐忍受苦，凡事有神助，化凶为吉，以苏武之忠，随后终得归汉为官也，就签而论，凡事极其辛苦，但到底可达目的');
INSERT INTO `huangdaxian` VALUES (33, '第三十三枝', '中平', '孔明识破曹操', '曹操虽有深谋计智慧难瞒诸葛候试看东风都可借更能流马木成牛', '曹操虽有奸计，而不瞒得孔明，能借东风以烧曹兵，又造木牛运粮，以养军士，则曹操奸谋，终不可用矣，求得此签者，切不可奸谋害人之心，人可瞒，天勿瞒，必须立心修善，可以化凶为吉，不可学曹操之奸计也，就签而论，凡事不利，要防小人是非口舌，如立心光明正大，可化凶为吉也');
INSERT INTO `huangdaxian` VALUES (34, '第三十四枝', '中吉', '大舜耕历山', '大舜虽耕在历山心常孝顺两嚣顽田中之象同家象善恶分明即此间', '古人有舜在历山田，父母皆顽梗，不讲仁义忠信，而大舜事之极孝顺，田常有象代舜耕田，有鸟代舜耕草，知能行善，则由天遣神佑，可免辛苦，若行恶，象不代他耕田矣，此即可以分出善恶，求此签善吉，作恶凶，就此签而论，亦当作为吉');
INSERT INTO `huangdaxian` VALUES (35, '第三十五枝', '中吉', '唐僧取经', '天将降任此其人筋骨先劳苦彼身莫谓景佳来可易贫穷富贵有前因', '天将以大任降此人，必先以贫穷劳苦其身，莫谓富贵发达，佳景来得轻易，人之贫穷富贵有前世因果也，求得此签者，要立一片善心，凡事勿辞劳苦，将来必有报应，就此签而论，有佳景二字，实则此签有吉而无凶，但必先要一番艰辛，不修善则富贵不来也，此先难后易之签，要慎防小人口舌');
INSERT INTO `huangdaxian` VALUES (36, '第三十六枝', '中吉', '薛平贵归家', '此事真如到岸船何忧风水不相全举头便见前村落屋角斜阳灶己烟', '行船已湾到岸，不忧无风无水之虑，举头又见自己之村乡屋角煮饭烟起，此乃薛平贵回家会妻，来到乡村前所见之景象，心安快乐，无忧无虑，求得此签者，事事平稳，有吉无凶');
INSERT INTO `huangdaxian` VALUES (37, '第三十七枝', '上吉', '东坡游赤壁', '月夜秋江下钓鳌鱼形恰似四腮鲈家藏旧酿堪盈斗与友飞觞尽倒壶', '苏东坡月夜与友泛舟游于赤壁，钓得四腮鲈鱼，有一斗家藏旧酒，与好友共斟同饮，此乃快乐优游之景象也，若求得此签者，所谋顺遂，百事皆吉，处处顺利');
INSERT INTO `huangdaxian` VALUES (38, '第三十八枝', '中吉', '陶渊明辞官', '归去来兮仕官闲室堪容膝亦为安南窗寄傲谈诗酒倚杖徘徊饱看山', '晋陶渊明，辞官归隐，对于做官看得甚闲，屋小仅堪容膝，亦此为可安居，倚南窗谈诗饮酒，倚杖看山，此一，逍遥之安乐光景，求得此签者，世事看得化，又要知机，不可贪图富贵则逍遥自在，无妨碍，当要想透此签首句一闲字，照此签意有吉而无凶');
INSERT INTO `huangdaxian` VALUES (39, '第三十九枝', '中吉', '夷齐耻食周粟', '夷齐不忍食周粟兄弟心甘采蕨餐让国名应垂万古可怜饿倒首阳山', '伯夷与叔齐是商朝孤竹君的两个儿子，孤竹君废长立幼，死后立叔齐为继承人，但叔齐却坚决要让给哥哥，伯夷也拒绝接受，结果两人放弃做君王的机会，先后逃到周国，后来周武王伐纣，伯夷叔齐叩马谏阻，周王灭商后，两人耻食周粟，逃到首阳山，采薇蕨野草充饥，最终饿死，伯夷叔齐一向都被知识分子，崇拜为高尚节气的榜样。');
INSERT INTO `huangdaxian` VALUES (40, '第四十枝', '下下', '俞伯牙碎琴', '人世知音能有几碎琴都为子期亡坟前洒尽千行泪隔别阴阳各一方', '春秋时出了一位杰出的琴师名伯牙，他有一位知音，就是钟子期，可惜钟子期比伯牙先离开这世界，伯牙悲痛不已，把心爱的琴摔得粉碎，他哭着在坟前说：世上只有子期才领会我的琴意，子期死了，阴阳相隔，天各一方，弹琴还有甚么意思呢！从此真的不再弹琴了。此签为下下，既有悲痛之象，亦有失友失物之意，而且暗示本身的才华无人赏识。');
INSERT INTO `huangdaxian` VALUES (41, '第四十一枝', '中吉', '张骞月夜浮槎', '浮槎月夜到天河曾见天姬织锦梭石得支机人罕识那知此宝出云窝', '张骞先师于月夜泛艇到天河，见仙女织机，遂取其机头之石而归，世人少有识此宝，不知此宝出自云间也，此签言自己有宝物而不识，此难遇贵人之景象也，求得此签者，当力行方便，善与人同，自有贵人来赏识矣，难得之宝而我独得之，吉祥也，此签凡事皆吉，无凶，无碍，不用忧疑');
INSERT INTO `huangdaxian` VALUES (42, '第四十二枝', '中吉', '王允献貂婵', '月明散步到花栏无策焉能剿灭奸幸有貂婵思定国英雄难过美人关', '东汉时，有奸臣，董名卓，王司徒允欲诛灭之而无计策，月夜在花栏边散步，有婢女名貂婵，欲出计安定汉室，，司徒遂将貂婵嫁与董卓，卓为英雄人物，乃昏迷于貂婵，终受诛灭，是英雄难过美人关也，得此签者，要立心忠直，有此善心，可以感动得人，必有贵人扶助，先难后易，终必成功也，此签有吉无凶，但要防避小人口舌');
INSERT INTO `huangdaxian` VALUES (43, '第四十三枝', '下下', '韩文公被贬', '只因直谏怒天颜昼夜难离在马鞍主朴奔忙神亦倦更加雪重拥蓝关', '韩文公以直谏激怒于人君，至被贬远方，日夜骑马鞍行之不歇，主仆如此奔忙，精神亦倦，更加遇落大雪，拥塞蓝关之路，而不能行，此辛苦之景象也，求得此签者，当谨慎，多行善事，亦可逢凶化吉，就此签而论，凶多吉少，要防小人是非');
INSERT INTO `huangdaxian` VALUES (44, '第四十四枝', '中吉', '唐天宝评花', '满园春色斗新妆意似争姘夺国香到底是谁居丽首牡丹艳冠百花场', '唐朝天宝年间，玄宗在位时，可称全盛时代，所谓花开富贵唐天宝是也，签载满园春花斗开得好样，到底以牡丹花为第一，此签有一种庆闹景象，凡事俱皆平稳无碍也');
INSERT INTO `huangdaxian` VALUES (45, '第四十五枝', '中平', '王质遇仙', '采樵不意到云天闲看敲棋二老仙柯烂也思归故里山中七日世千年', '古人姓王名质，入山采薪，巧遇两仙人敲棋，看到斧头柄栏了，然后归家，在山中不过七日，而世上经已过千年矣，结局似觉平淡，无甚欢喜，亦无妨碍，求得此签者，各事皆平常而己');
INSERT INTO `huangdaxian` VALUES (46, '第四十六枝', '下下', '左慈戏曹操', '黄柑数盒献曹公剖看原来肉尽空怒动奸雄挥铁斧奔忙身入万羊中', '三国时，左慈献数盒于曹操，操将其柑剖开，无一个有肉，激怒曹操，以斧头斩之，慈即奔入群羊中退避，，以假局欺人，惹祸归身，有凶无吉矣，求得此签者，凡事凶多吉少，急宜多行善事，凡做一，必要真实无妄，忠直存心，宽厚待人，方能化凶为吉也，求得此签，要防小人是非口舌');
INSERT INTO `huangdaxian` VALUES (47, '第四十七枝', '中平', '吴主索荆州', '遥遥千里来西蜀欲问荆州那日还刘备不言声泪下自思无策转吴间', '昔刘备向吴借荆州，及刘备得蜀之后，东吴使人来西蜀，索取荆州，刘备一言未出，便痛哭流泪，自思无计策可以圆转也，以一哭得还荆州，有借无还，而当哭泣之时，乃悲愁之景象，求得此签者，凡事要隐忍受苦，多行善事，方能转祸为福也，论此签凡事凶多吉少');
INSERT INTO `huangdaxian` VALUES (48, '第四十八枝', '中平', '卓文君卖酒', '绣阁听琴自起思改妆寅夜最欢时可怜沽酒临邛市才子佳人两下厨', '昔卓氏有女名文君，新寡，听司马相如弹琴，遂起情心，乘夜奔往相处，成为夫妻，但家贫，两夫妇在临邛市开设酒档，一个是才子，一个是佳人，两家都要当炉卖酒，此亦有辛苦之气象也，司马相如后大贵，求得此签者，凡事要隐忍受苦，先难后易也，此签不可作为吉，亦不作为凶，只得平常二字而已');
INSERT INTO `huangdaxian` VALUES (49, '第四十九枝', '中吉', '司马相如题桥', '十年窗下苦功成有志难舒愿不轻试看题桥十三字生平心誓确钟情', '昔司马相如，十年窗下苦心读书，贫穷不得意，其为有志气之人，故当入蜀过桥，题十三字于桥柱曰，他日若不乘高车驷马，不过此桥，随后果得大贵回家，经过此桥，有志者事竟成矣，求得此签者，凡事要自己立定志向，务须要不辞劳苦，自然先难后易，皇天向不负好心之人，若能修善者，报应更迅速，论此签，各事有吉而无凶，此签拟上吉与第八十五枝语意相同，是为一快活如意之景象也');
INSERT INTO `huangdaxian` VALUES (50, '第五十枝', '中吉', '伍员赠剑渔父', '记得当年伍子胥潜奔难渡幸逢渔欲将宝剑相持赠大义交朋郄不辞', '昔伍子胥楚人也，楚王追杀之，避难奔至江边，有一渔舟救之渡江，伍子胥将自己之剑赠于渔父，渔父不受，以此大义相交，故辞剑也，求得此签者，凡事不可有贪心，有益于人之事，无论人之知与不知，人之报与不报，力到便做，讲义不讲财可也，以签论，凡事平稳无碍，此凶中有吉之签也');
INSERT INTO `huangdaxian` VALUES (51, '第五十一枝', '中平', '成王剪桐封弟', '剪桐虽是作儿嬉封弟成王语不移何以伪为成实事言因无戏故如斯', '周成王在宫中，自剪桐叶如圭形，与弟戏言曰，封尔为诸侯，至周公入贺，成王曰，吾戏言耳，周公曰，君无戏言，遂封其弟唐叔于唐，随后其子改唐国日晋国，求得此签者，一言一行均要子细，不可作为儿戏，恐弄假成真，真恨错则难以挽回也，论此签亦属平平常常而矣，诸事亦无阻而无碍');
INSERT INTO `huangdaxian` VALUES (52, '第五十二枝', '中平', '盘古开辟天地', '上清下浊成天地清浊相凝便作人尔欲签求明白事且将三等细分明', '气清而上浮者为天，气浊则下凝者为地，半清半浊在中间为人，三等分开，求得此签者，凡事以清洁为上，不可污，不可浊，若有所贪，即成污浊，流而为下矣，倘有时清洁，有时污浊，则不上不下，是中间之人，三等分明，随人自作，存善心行善事，斯为清洁而居上等也，清洁之人凡事皆吉，污浊之人，凡事皆凶');
INSERT INTO `huangdaxian` VALUES (53, '第五十三枝', '中吉', '冯暖客孟尝', '珠履三千客孟尝谁人识得有鹰扬其中弹铗归来者便是英雄志莫当', '战国时，齐公子孟尝君，有食客三千人，冯暖为下客，弹剑铗而歌曰，弹铗归来乎食无鱼，出无车，孟尝君因之待以上客之礼，冯暖为英雄人物，其志气无人可当也，此签大意，言众人所不能识者，就其中有一个英雄，求得此签者，凡事一定有好处，即英雄也，但必要修善，有神护助，始能识得出其好处耳');
INSERT INTO `huangdaxian` VALUES (54, '第五十四枝', '中平', '庄周梦蝶蜨', '庄子酣眠成蜨梦翩翩飞入百花丛天香采得归来后犹在高床暖枕中', '古人姓庄名周，梦自己化为蝴蝶，飞入花丛采花，梦醒之后，乃在高床暖枕中也，此乃一片假局，求得此签者，凡事多虚少实，究无可取，但亦无大妨碍，因此签有逍遥自在之意也');
INSERT INTO `huangdaxian` VALUES (55, '第五十五枝', '中平', '吴隐之投沉香', '浦号沈香遗旧恨渡江犹忆古人心可怜当日辞官去虽有馨留不易寻', '古人吴隐之，来广东作官，爱护子民，两袖清风，及辞官回家，人民感其德政，纷纷赠以礼物，隐之不接受，只受一沉香扇坠，及乘舟离任，风浪大作，隐之祷告天地，将该沉香扇坠投于水，以示清廉，果然风平浪静，一路平安达家园，后人因此称该处为沉香浦，渡江者每追念当年隐之之清廉，求得此签者，凡事平稳，须然吉中微有凶，但到底必好，不用忧疑');
INSERT INTO `huangdaxian` VALUES (56, '第五十六枝', '中吉', '吕祖桃木剑', '安知此剑不成龙见水都应出袖中他日飞腾千万里上空妖娇有云从', '袖中之剑，见水则出而化为龙，飞腾万里，此古之奇事，吉祥之兆也，但本签有安知二字，则此剑仍未化龙也，求得此签者，有吉无凶，如能多行善事以培补之，则凡事愈顺遂，必发达矣');
INSERT INTO `huangdaxian` VALUES (57, '第五十七枝', '中吉', '独占花魁', '小楼春雨声初歇彳亍街头屐不停忽听卖花人入巷一枝买得慢慢行', '春雨初歇，穿屐行街者不停，忽闻有卖花者入巷叫卖鲜花，买得花一枝，而慢慢行路，恐路湿滑也，求得此签者，凡事要淡定，不可急速，能谨慎自无差错矣，依此慢慢行三字论之，则平安大吉，凡事亦平稳无碍');
INSERT INTO `huangdaxian` VALUES (58, '第五十八枝', '下下', '蹇叔谏君', '秦师大败在殽山三帅皆擒尽放还蹇叔谏言因不听倒戈舍甲返秦间', '秦穆公不听老臣蹇公之言，出师侵郑与晋人战于殽，秦师不敌大败，三个大元帅俱皆被擒，秦穆公之女，本为晋君之母，请晋康公将三元帅放还回秦，倒戈弃甲，此签凶险之极，求得此签者，凶多而吉少，要多行善事，方能转祸为福也，宜当天作福吉');
INSERT INTO `huangdaxian` VALUES (59, '第五十九枝', '下下', '东施效颦', '涴溪纱女美无双媚至吴王国破亡最恼东施效颦笑山鸡岂可胜鸾凰', '昔有美女名西施，原为在溪边涴纱之女，越王勾践，送上西施于吴王，媚得吴王极昏，终至亡国，有女子东施者，其貌极丑，乃学西施之颦笑以媚人，以至弄巧反拙，所谓山鸡岂会变凤凰，即此之意也，求得此签者，凡事要守份安命，顺时听天，不可心高而强求妄想，明知自己不如人，而强学于人，反为不美，必凶多吉少');
INSERT INTO `huangdaxian` VALUES (60, '第六十枝', '中平', '李白醉和番书', '和番醉笔似云烟日在长安酒店眠倘遇唐皇颁令召重呼不上木兰船', '古人李太白，性喜酒，日眠于长安市酒店，唐明皇有令召之，再呼亦不下船，因此地乃一好快活逍遥之所，而，他不贪富贵者也，求得此签者，宜看各事等闲，不可贪心，勿与人争长短，况且色即是空，即是色，不为物欲所累，退一步想，自然快乐，以签论之，凡事亦平稳无碍');
INSERT INTO `huangdaxian` VALUES (61, '第六十一枝', '下下', '十二金牌召岳飞', '十二金牌速召回奸雄设计几时灰可怜一旦功劳散老少扶车不断哀', '宋岳飞，大败金人，奸臣秦桧，设法假冒圣旨害之，擅用十二度金牌，召岳飞收兵回朝，使岳飞之兵散局，而不成就，老少扶着岳飞之车而泣，哀声不断，岳飞卒被秦桧害死，此签有凶无吉，求得此签者，事事要提妨小人侵害，且要多行善事，广结善缘，乃能消此劫气，逢凶化吉，转祸为福也，宜当天作福吉');
INSERT INTO `huangdaxian` VALUES (62, '第六十二枝', '中平', '孔子不仕', '美玉于斯韫匮藏休求善价费商量沽之亦可随相待此物何须自看常', '美玉藏之于柜，必要有人来问，如肯出高价钱，然后发卖，不可为求人买，将自己看低，而贱价售之也，若求得此签，凡事不必心急，必须要待时机，而后方可动，如若自己看低自己，枉道求合，究不如守旧为高也，凡事平稳，无甚阻滞，渐见光明矣');
INSERT INTO `huangdaxian` VALUES (63, '第六十三枝', '中吉', '颜回乐道安贫', '陋巷箪瓢不足愁旁人见此甚为忧不知乐道忘贫乏亚圣芳名万古留', '古人姓颜名回，一箪食，一瓢饮，在于陋巷，旁人见之甚忧，而颜子自乐其道，他不觉自己之穷，工夫做到圣人地位，而名留万古，求此签者，凡事务须要忍于贫苦，一切财利，不可贪恋，一于真心修善，则实至名归，名垂不朽矣，就算贫乏终身，亦无碍也，此签有吉无凶');
INSERT INTO `huangdaxian` VALUES (64, '第六十四枝', '中吉', '孟之反殿师', '奔殿须知上古人入门策马不夸能败师谁肯甘从后托谓鸣骢畏苦辛', '昔鲁与齐战，鲁败北，孟之反奔到收尾，第一，谓之殿军，有功能最著者也，在人必夸张不已，孟之反入策马曰，非敢后也，马不进也，此不夸自己之功能，孔子尝称赞之，求得此签者，凡事要忍辱待人，不可与人争论，修德宽心接物，如此可逢凶化吉矣');
INSERT INTO `huangdaxian` VALUES (65, '第六十五枝', '下下', '胭脂井藏妃', '隋灭陈时戟伐纷都因妖媚闭明君东奔西赴无藏息井里胭脂隐玉人', '昔陈后主，为张贵妃孔贵妃所媚，昏迷之极，隋高祖起兵伐之，陈后主东奔西走，无可藏匿，遂与贵妃等隐藏于宫中之胭脂井，隋兵到，以绳引之而出，执之以归，遂将陈灭，败国而丧身，此乃极凶之签也，求得此签者，凡事要谨慎，勿受小人昏闭，多行善事，乃能消此劫气，转祸为福也，此签要防女子小人口舌，宜天后庙作福吉');
INSERT INTO `huangdaxian` VALUES (66, '第六十六枝', '上吉', '羲之会群贤', '兰亭雅会众群贤曲水流觞舍箸弦天朗气清风惠畅茂林修竹乐怡然', '古人王羲之，三月三日，合众贤人至会稽山之兰亭，是日天气朗润而不暗，惠风和畅而不寒，此地有茂林修竹，王羲之与群贤，曲水流觞而饮西，此乃一种自在逍遥快乐景象，此签百事吉祥，此签乃上吉，是快活景象也，与第七十八枝相同，以三月占得该签为最合');
INSERT INTO `huangdaxian` VALUES (67, '第六十七枝', '中平', '李元霸称雄', '人维勇力不能当莫恃英雄独冠场可挟泰山超北海身心犹贵重存亡', '人虽有勇力，不可自恃，李元霸称第一英雄，能做得世间极难之事，能挟泰山以超北海，其身也要保重，虑其存而易亡，此心要持守，不可亡而不存也，求得此签者，必要存一点善心，凡事和霭，不以身犯险，自无不吉矣');
INSERT INTO `huangdaxian` VALUES (68, '第六十八枝', '中吉', '姜公遇文王', '久抱凌云吉未舒荷竿渭水钓游鱼文王千里求贤士灭纣兴周任意如', '古人姜太公，久，出身之志，而未合时，隐于渭水钓鱼，及文王远求贤士，拜姜太公为帅，灭商兴周，任其意，自如，此签乃先难后易，求得此签者，凡事存一片善心，守慎安命，顺时听天，终必有贵人引提拔，事事如意吉祥，荣华发达也，试拭俟之，又此签要藏器待时，与八十四枝签相似');
INSERT INTO `huangdaxian` VALUES (69, '第六十九枝', '中吉', '韩文公祭鳄鱼', '忠义存心官十载年丰民乐惠难忘鳄鱼毒害都能息祷告长江北海王', '韩文公为潮州刺史，忠心为国为民，年丰民乐，潮州大海有鳄鱼食人，韩文公祭之，其害遂止息，求得此签者，务要自己存一点善心，宜多行方便则善气所感，可逢凶化吉，劫运可消除矣，就此签论，平稳无碍，有吉而无凶，但要防避小人是非口舌');
INSERT INTO `huangdaxian` VALUES (70, '第七十枝', '中平', '塞翁失马', '可比当年一塞翁虽然失马半途中不知祸福真何事到底方明事始终', '古人塞翁失马，人吊之，塞翁曰安知非福，随后马回，人贺之，塞翁曰，安知非祸，其子骑跌伤足，人亦吊之，塞翁曰，安知非福，其后秦王筑城，各家也要人去筑城，塞翁以其子不便于行动，遂免，是福也，人生祸福，难以判定，到底方知，惟行善者，祸可以转为福，若求得此签者，不可以现下有福而欢喜，亦不可因现下有祸而忧愁，总要立定主意，一于行善，方便于人，此签吉凶难定，随人自作，凡事宜子细，方可避免');
INSERT INTO `huangdaxian` VALUES (71, '第七十一枝', '中下', '庄周激水活鲋鱼', '涸辙之中鲋困之穷通自可卜当时若能引得西江水他日成龙也未知', '鱼困于水车坑，辛苦极矣，若引西江水来救之，则他日成龙未可知也，求得此签者，有受困而难得贵人之象，要立即修善以感动人心，后必有贵人来提拔，转祸为福，宜早不宜迟，如鱼失水，不能待久也，此签乃凶多吉少，现下尚未定者，全在人事而为之');
INSERT INTO `huangdaxian` VALUES (72, '第七十二枝', '中平', '宋人守株待兔', '兔儿久待意何如堪叹愚人独守株算是无能令我笑不须守旧自拘拘', '古人有看守一树，待兔来者，待之甚久，不见兔来，此人仍守树而不去，其愚拙无才能，真令人笑矣，求得此，者，不可拘泥守旧，若一味固守，虽属无大碍，究亦无益也，又何若而为此哉');
INSERT INTO `huangdaxian` VALUES (73, '第七十三枝', '上上', '状元衣锦荣归', '夹道花香衬马蹄蓝袍改换锦衣归满街红粉皆争羡翘首芳名雁塔题', '中进士点状元谓之雁塔题名，穿着蓝袍去而换转锦衣归，一路花香衬马蹄，满街都是红粉女，争看状元来，此乃群众欢呼快活之事，求得此签者，万事皆吉祥');
INSERT INTO `huangdaxian` VALUES (74, '第七十四枝', '下下', '朱买臣分妻', '回忆当年运蹇时夫妻反目两分离名题雁塔归来候覆水马头时否悲', '古人朱买臣，家贫其妻求去，随后朱买臣大贵，其妻愁恨，欲想求再为夫妻而不得，如覆水于马头，此水已经落地，难以回收也，求得此签者，凡事要隐忍受苦，将来必有发达之日，若不能立定坚志，遇有不如意之事，即欲求改，到时必恨错难翻矣，就此签论，有凶无吉，须知机也');
INSERT INTO `huangdaxian` VALUES (75, '第七十五枝', '下下', '伦文叙戏妻', '婚姻起可厌家贫文叙夫妻两拆分一旦首登龙虎榜戏妻楼坠自身亡', '古人伦文叙，家贫，其妻因而改嫁去，及伦文叙中状元回家，其妻恨错难翻，跳楼自尽而亡，此凶极之签也，求得此签者，凡事总要安份守己，不可多心妄想，捱得若楚，然后苦尽甘来，因祸而得福也，世界花花，不外循环两字，否极则必见泰来，若不修善而妄动横行，祸机一发，到时悔之莫及矣');
INSERT INTO `huangdaxian` VALUES (76, '第七十六枝', '中平', '修身不厌贫', '人能乐道自修身疏水曲肱岂厌贫不义而富且富者我心都作是浮云', '昔孔子食粗饭，饮水，枕手肱，不厌自己贫穷，仍然快乐，自修其身，不合义之富贵则视如浮云之无有，求得此签者，必要隐忍，受得艰辛，不可有厌气，且要乐心行善事，修身积德，要把定自己，不贪不谋，要能安贫乐道，始终无怨心，将来必有一番佳景，可预卜之，不用忧疑也');
INSERT INTO `huangdaxian` VALUES (77, '第七十七枝', '中平', '公冶长受辱', '鸟语能通公冶长南山有个虎驮羊其身虽在于缧绁到底非关自已殃', '古人公冶长，能通晓鸟之言语，家贫无饭食，有一鸟说南山有虎拖羊，公冶长遂往南山执羊食之，而失羊之人疑公冶长偷羊，告官出差，将公冶长押在狱中，到底非关自己有罪，随后又得此鸟救还公冶长出狱，求得此签者，凡事要谨慎，不可轻听人言，不可理人闲事，自己仅能以收善为心，虽有意外之虑，受人冤屈，不可与人争论长短，终必有救星，可逢凶化吉，此乃先难后易之签，要防小人');
INSERT INTO `huangdaxian` VALUES (78, '第七十八枝', '上吉', '曾点论志', '瑟希铿尔尚留声春暮时刚春服成冠五六人童六七舞雩归咏畅幽情', '昔曾点与孔子言，瑟希铿称，舍瑟而作，时逢三月，暮春之衣服，单衫夹衲，刚已缝起，与二十岁之冠者，已婚之人，约五六人，十五六岁之童子，又约六七人，同一队往鲁国沂水处，澣濯其身，舞雩林下乘凉，一路唱歌而归，以此为舒畅其心情，此乃快活之景象也，求得此签者，凡事必须安守本，善与人同，则随时随地无不优游快活矣，此签乃是上吉之签，三月抽得最合时宜时逢三月，暮春之衣服，单衫夹衲，刚已缝起，与二十岁之冠者，已婚之人，约五六人，十五六岁之童子，又约六七人，同一队往鲁国沂水处，澣濯其身，舞雩林下乘凉，一路唱歌而归，以此为舒畅其心情，此乃快活之景象也，求得此签者，凡事必须安守本，善与人同，则随时随地无不优游快活矣，此签乃是上吉之签，三月抽得最合时宜曰');
INSERT INTO `huangdaxian` VALUES (79, '第七十九枝', '中平', '张良悟道', '富贵有如春梦熟世人何苦力争求任他秉笏当朝立到死惟留土一坏', '富贵如春梦，一醒便无，世人何苦强求，任你为相封侯，官居极品，人生数十年光景，死后惟剩一堆坭土而已，一念及此，殊觉冷淡，求得此签者，惟安份守己，切勿起贪心而妄求，更要存心积善，名垂不杇，万载留存，更为实际，切不可以虚之心来对人，此签无欢喜处，亦无害处，平常而已');
INSERT INTO `huangdaxian` VALUES (80, '第八十枝', '中吉', '乐广释疑', '飞觞对舞几时赊弓影横杯误作蛇猜透诗中元妙诀泰来否极事无差', '饮酒歌舞，本极快活，而杯中弓影，作错误认为蛇，是无事而为有事也，不知人衰到极地，天道循环，自然否极泰来，断无差错，可预卜之，求得此签者，必要力行善事，即使对人有愧，对鬼神亦无惧，则心有主宰矣，遇艰苦之事，亦易应对，不至误为蛇落杯等弊，此乃衰极而转归，荣发之签也，凡事俱平稳无碍');
INSERT INTO `huangdaxian` VALUES (81, '第八十一枝', '中吉', '雌雉朝圣', '山粱雌雉得其时上下飞鸣自乐之色举须知翔后集作声三嗅过山欹', '孔子与子路经过桥边，见山上有一雌雉飞上飞落，真得其时，看见有人想害自己之颜色，实时高飞远去，四围审慎乃敢栖止，又鸣三声而飞过山侧，此有惊险之意也，鸟之知机如此，求得此签者，触物思人，当要识时务晓机关，遇有不合意者，势色不同，立即转机退避，探真地步，稳阵无险，方可停留，恐人害己，而入其牢笼而不知，故要提防小人及是非也，此签如将一切口舌避免方吉');
INSERT INTO `huangdaxian` VALUES (82, '第八十二枝', '中平', '孔子击盘', '圣人击磬在于卫谁料过门有荷篑嗟叹有心挽道穷可怜日月今将逝', '昔孔夫子有卫国，磬，有一人挑一竹箩行过门口，闻磬声而嗟叹，话击磬者系有心救世之人，可惜今日年纪将，耳，求得此签者，凡事当以救人为己任，或出钱，或出力，有利益于人者便要做，幽则有神赏，明则有人称羡，何乐不为，若年纪老更要及早行善以救人，则必有贵人扶助，此签似有忧愁气象，问事者亦平常，无碍，平稳，但是非小人口舌，恐难避兔矣，宜慎防能避之者吉');
INSERT INTO `huangdaxian` VALUES (83, '第八十三枝', '中平', '赤松子招隐', '凡尘身历几时闲世事浑如迭迭山既富尚忧无贵子不知花放又花残', '人在凡尘，无几时得闲暇，冷眼一看，世事之多，堆积如山，既得富而有钱，尚忧无贵子，得一件又想另一件，须知花花世界，花开则花又谢也，此签之意，世道循环，无长久富贵，一切功名钱财，妻儿子女，第一要知足，第二要看化，随遇而安，不为世事所累，此身才有日清闲耳');
INSERT INTO `huangdaxian` VALUES (84, '第八十四枝', '中吉', '韩信弃楚归汉', '满腹奇才志未冲铁鸡难举意无容张良指示身投汉项羽乌江命自穷', '朝韩腹奇才，而不得志，力弱欲举铁鸡而不得，随后遇张良，教之投入汉高祖军中，辅佐高祖，，败项羽，在乌江自刎，此签乃先难后易也，求得此签者，作事不可心急，暂时安份守己，行修福，终必有贵人提拔，风云际会，荣华发达，吐气扬眉也，人生斯世，时运未到，藏器待时可也，此签要藏器待时，与第六十八枝相同');
INSERT INTO `huangdaxian` VALUES (85, '第八十五枝', '上吉', '太乙燃藜', '太乙燃藜照读书十年窗下苦功舒扬眉吐气袍穿锦驷马高车拥道随', '太乙神燃藜枝，照明读书，又用十年辛苦工夫，一旦得大贵回家，身穿锦袍，有高车驷马随后，此荣华发达，快活无忧之景象，求得此签者，万事如意吉祥，贵人得力，敢决求得此签者，必定丁财两旺也');
INSERT INTO `huangdaxian` VALUES (86, '第八十六枝', '中平', '侃母迎宾', '截发迎宾否也贫贫中贤妇更何人古今只有陶侃母所以名留万代闻', '陶侃是晋代一位德才兼备的大官，最初为县吏，因表现出色，后逐步陛迁官至征西大将军，荆江两州刺史，统领八州军事，为官四十年如一日，不贪不饮不赌，从不浪费一纸一木，这支签是讲述陶侃年少时家贫，无钱迎迓宾客陶母非常贤淑，毅然剪下自己的长髲，拿去变卖，这样的贤妇，古今只得陶母一人，是值得万世景仰的。');
INSERT INTO `huangdaxian` VALUES (87, '第八十七枝', '中平', '荀陆座谈', '会谈华座逞英雄究竟谁人秉大公一云日下荀鸣鹤一说云间陆士龙', '荀鸣龙，皆古时出色英雄人物，有一日，荀陆两人相遇座中谈论，一人讲一样，各逞英雄，难分，一，终亦无人能秉公决断之，此有口舌是非之象，求得此签者，不可乱听人言，及与人争执，，逢凶可以化吉，平安无事，此签不凶不吉，平平稳稳，但要防是非口舌，言语都要谨慎为是');
INSERT INTO `huangdaxian` VALUES (88, '第八十八枝', '中吉', '花木兰从军', '替父从军胆气雄须眉巾帼几人同以身报国忠而孝笑煞当时众巨公', '昔有女子花木兰，代父从军出战，以身报国，尽忠兼能尽孝，本系女子巾帼，而有男子须气概，英雄胆志，当时许多出色人物，衮衮诸公，皆不及此女子，真可笑矣，求得此签者，当即勇往向前，不辞劳苦，人所难造者，自己尽心竭力造之，有此气概，事事皆吉，就签论之，凡事均如意吉祥无碍');
INSERT INTO `huangdaxian` VALUES (89, '第八十九枝', '下下', '吴季子挂剑', '他乡远历佩鱼肠谁料徐君意欲将既返愿为相赠答且悬树下表情长', '吴季子，佩着宝剑游历他邦，经过徐国，徐君见此剑而甚爱之，季子欲待游罢之后，再经过徐国，然后将此剑送与徐君，及返，徐君己死，季子将剑挂于徐君之坟墓前树上而去，以表自己之长情也，求得此签者，凡事要谨慎而行，切不可随意，如属问自身签，探丧问病都不宜去，以免沾染病痛也，宜向社坛作福吉');
INSERT INTO `huangdaxian` VALUES (90, '第九十枝', '中平', '红拂女私奔', '细整残妆夜欲奔座中李靖更何人那知虬髯情钟处拔剑三回未敢陈', '昔有红拂女，与李靖有私情，夜欲私奔，红拂女方梳妆，适遇虬髯公到，见此女而钟爱之，李靖以为虬髯公调戏此女，欲拔剑斩之，红拂女止之，三次欲拔剑而未动，彼此随后亦无妨碍，求得此签者，凡事隐忍让人，方能逢凶化吉，就签而论，不为吉亦不为凶，不过无大碍，平淡而已');
INSERT INTO `huangdaxian` VALUES (91, '第九十一枝', '上上', '月里嫦娥', '蟾宫月殿桂飘香玉箧团圆万里光六水三山归镜里无瑕一片挂穷苍', '月光圆满，丹桂飘香，无半点云霞遮蔽，万里光明，四围山水都照见，求得此签者，凡事如意吉祥，毫无阻滞，谋望亨通，有求必就，暑秋天抽得，更觉合时');
INSERT INTO `huangdaxian` VALUES (92, '第九十二枝', '中吉', '在齐闻韶乐', '至圣周流列国行在齐得听奏诏乐三月不知嘉肉味善哉大道可功成', '昔孔子周游列国，在齐国闻人作诏乐，因之学作诏乐，有三个月之久，每膳不知肉味，其专心为此，必得成功矣，此签大意，言人凡事能专心去做，则必成功，求得此签者，作事要有恒心，有坚志，不可分心骛外，则自然有吉无凶矣，凡事顺利');
INSERT INTO `huangdaxian` VALUES (93, '第九十三枝', '下下', '孔子闻郑卫之音', '郑卫之音不忍听淫风败俗国将倾令人深入迷津路所奏全非古乐声', '郑卫之音，败坏风俗，至于亡国，令人听闻后一味昏迷依恋，有损无益，求得此签者，凡事当谨慎，择善而行，一切声色财利不合义者，切不可贪，必至败家丧身矣，要防小人说是非，慎勿轻信人言');
INSERT INTO `huangdaxian` VALUES (94, '第九十四枝', '中平', '髯公远走扶余', '一窟难客两虎儿乘风别岭名栖之名山自守为巢穴可免伤残后悔迟', '一山不能藏二虎，若有风起，当乘风而分栖别岭，各守一巢穴，免至两家相争，两家都受祸，恨错难返也，求得此签者，两人谋事必不成，即成亦难得长久和衷共济，凡事总要知机，预先退避，不可勉强去做，又要审度时势方可举行，如虎之待有风，乃可分居别处，如此彼此可免伤残矣，此签凶中似有吉，若能隐忍让人，则可以转祸为福，不可不知');
INSERT INTO `huangdaxian` VALUES (95, '第九十五枝', '中平', '女娲炼石补天', '功勤一篑可成山由少而多莫惮烦作事畏辛今汝画补天炼石亦无难', '勤力担泥，一斗又一斗，由少而多，可以积成一山，今人作事，每好逸恶劳，是划地自限也，若能立定坚志，努力向前，如女娲氏炼石以补天，亦无难事也，求得此签者，凡事要不辞劳苦，勤恳用功，终必有成，到时一劳永逸，苦尽甘来也，乃平稳之签，不用忧疑');
INSERT INTO `huangdaxian` VALUES (96, '第九十六枝', '中平', '游子思家', '羌曲频吹韵更悲异乡作客触归期南来孤雁如怜我烦寄家书转达知', '凡游子出外作客，以依期归家为快，今作客他乡，闻吹羌笛之声，音韵悲切，想起回家日期而未得归，惟望雁鸿怜悯，托带家书以报平安，此乃出路艰难之景况，求得此签者，凡事宜慬慎，秋季更要注意，宜向天后娘娘作福吉');
INSERT INTO `huangdaxian` VALUES (97, '第九十七枝', '中平', '康顺钓鱼', '凭栏晚眺倚南楼满目风光景色幽一叶小舟频下钓渔翁钓得有鱼无', '凡取鱼者，用网一抛而得鱼多，用钓则逐个而得鱼少，今登楼晚望，满目佳景，见一艇细小如叶，浮于水面，不甚安稳，渔翁频频下钓，未有休息，而未知钓得鱼否，此签仍无大碍，但凡事宜谨慎');
INSERT INTO `huangdaxian` VALUES (98, '第九十八枝', '中平', '管鲍分金', '入山种玉嫌田狭掘地寻金厌客多富贵贫穷天注定世人何苦力奔波', '入山种玉，田狭则收成少，掘地求金，人多就会分得薄，实则为人不必如此辛苦奔波，因富贵二字，有前生因果，上天已安排分配注定矣，求得此签者，凡事宜力到力为，修善果植福基，自然可以获福，不必强求，所谓不须着意求佳景，自有奇逢应早春，此签平稳无碍，不用忧疑');
INSERT INTO `huangdaxian` VALUES (99, '第九十九枝', '中平', '韩文公遇雪', '雪拥桥头马不前风狂渔父莫开船水流花谢人谁惜早立坚心志勿偏', '唐朝韩文公，被贬到潮州为官，来到秦岭，遇大风雪，马不能行，船亦不能开航，所谓云横秦岭家何在，雪拥蓝关马不前，进退为谷，幸得湘子救护，始获脱危难，求得此签者，凡事务须谨慎，更宜防小人口舌是非，此签虽无大碍，亦无可喜，能谨慎可得平稳而已');
INSERT INTO `huangdaxian` VALUES (100, '第一百枝', '中吉', '唐明皇赏花', '百花竞放贺阳春万物从今尽转新末数莫言穷运至不知否极泰来临', '此签乃收尾第一百目到此，则为尽头，人运到此，则为穷极矣，惟穷极无路，转移在人，易穷则变，变则通，运循环，无往不复，如百花争放，以贺新春，万象维新，人亦从此改过从善，涤虑，，旧染污浊，焕然一新，虽目前否塞之极，自有亨通荣发之时也，求得此签者，渐进佳境，苦尽甘来，转祸为福也');
