-- phpMyAdmin SQL Dump
-- version 2.10.3
-- http://www.phpmyadmin.net
-- 
-- 主机: localhost:3308
-- 生成日期: 2009 年 07 月 28 日 09:25
-- 服务器版本: 5.0.51
-- PHP 版本: 5.2.6

SET SQL_MODE="NO_AUTO_VALUE_ON_ZERO";

-- 
-- 数据库: `ming`
-- 

-- --------------------------------------------------------

-- 
-- 表的结构 `xzysday`
-- 

CREATE TABLE `xzysday` (
  `id` int(11) NOT NULL auto_increment,
  `xzmc` varchar(50) default NULL,
  `xzrq` varchar(50) default NULL,
  `yxqx` varchar(50) default NULL,
  `zhys` varchar(50) default NULL,
  `aqys` varchar(50) default NULL,
  `gzzk` varchar(50) default NULL,
  `nctz` varchar(50) default NULL,
  `jkzs` varchar(50) default NULL,
  `stzs` varchar(50) default NULL,
  `xyys` varchar(50) default NULL,
  `xysz` varchar(50) default NULL,
  `spxz` varchar(50) default NULL,
  `zhpg` longtext,
  `update_date` datetime default NULL,
  PRIMARY KEY  (`id`),
  KEY `id` (`id`)
) ENGINE=MyISAM  DEFAULT CHARSET=utf8 AUTO_INCREMENT=13 ;

-- 
-- 导出表中的数据 `xzysday`
-- 

INSERT INTO `xzysday` VALUES (1, '牡羊座', '03/21 - 04/19', '2009-07-08', '3', '4', '3', '3', '<p>78%</p></div>', '<p>65%</p></div>', '<p>金色</p></div>', '<p>9</p></div>', '<p>巨蟹座</p></div>', '让身边的环境中自然流出轻音乐，让今天的情绪能够在最放松的状态。<br />\r也更能以柔软有弹性的方式来应对今天可能需面对的事情。像是你不想接手的烫手山竽就要巧妙的推往别人身上。只要要领抓得好，可免掉日後一番辛苦喔。', '2009-07-08 00:00:00');
INSERT INTO `xzysday` VALUES (2, '金牛座', '04/20 - 05/20', '2009-07-08', '3', '4', '3', '2', '<p>75%</p></div>', '<p>68%</p></div>', '<p>银色</p></div>', '<p>0</p></div>', '<p>天蝎座</p></div>', '有礼的态度让跟你初次见面的人留下不错的印象喔。<br />\r有了这个好的第一印象往後将有不少受惠的机会呢。但是相反的，自己却要注意以外表来判断他人结果看错人的可能，尤其是挑选交友对象时很可能就因此错失良缘了。给别人好印象，也要对别人以更客观的角度去评价。', '2009-07-08 00:00:00');
INSERT INTO `xzysday` VALUES (3, '双子座', '05/21 - 06/21', '2009-07-08', '3', '4', '3', '3', '<p>77%</p></div>', '<p>75%</p></div>', '<p>橘色</p></div>', '<p>8</p></div>', '<p>金牛座</p></div>', '丰富有趣的话题让你成为被包围的中心人物。<br />\r多翻翻最近的时势新闻报导，掌握时势对本周的工作或人际关系话题颇有帮助喔。爱情运则还不错，情人表现得热情洋溢，不妨将姿态放高一点，稍微来点一点点任性的演出，更能勾起对方急欲接近你的感觉呢。', '0000-00-00 00:00:00');
INSERT INTO `xzysday` VALUES (4, '巨蟹座', '06/22 - 07/22', '2009-07-08', '4', '4', '4', '3', '<p>71%</p></div>', '<p>87%</p></div>', '<p>深绿色</p></div>', '<p>7</p></div>', '<p>牡羊座</p></div>', '只要给你一点小提示就能举一反三推论出不少好点子呢。<br />\r头脑转换灵活迅速的今天如果能搭配上资讯收集就更有利了。而最能让你启发灵感的就是报纸上的内容啦，尤其是早报可要仔细看看喔。随身带著收音机利用等车时间等听听最新消息也让候车时间不那麽无聊。', '0000-00-00 00:00:00');
INSERT INTO `xzysday` VALUES (5, '狮子座', '07/23 - 08/22', '2009-07-08', '3', '3', '4', '2', '<p>72%</p></div>', '<p>77%</p></div>', '<p>红色</p></div>', '<p>1</p></div>', '<p>双鱼座</p></div>', '头脑的转换灵活迅速，一点小提示就能举一反三推论出不少好结论呢。<br />\r而今天最能让你启发灵感的就是报纸上的内容啦，尤其是早报可要仔细看看喔。最近的运气虽是有些上上下下不大稳定，内心也有些不安与犹豫，不过却反而是慢慢将你导向梦想实现的转机。这段时间尽量与更多人接触，将有助於引导往这个方向走喔。', '0000-00-00 00:00:00');
INSERT INTO `xzysday` VALUES (6, '处女座', '08/23 - 09/22', '2009-07-08', '3', '4', '3', '3', '<p>72%</p></div>', '<p>59%</p></div>', '<p>粉红色</p></div>', '<p>3</p></div>', '<p>水瓶座</p></div>', '别人家的私生活、家务事尽量别涉入也别出馊主意。<br />\r免得被卷入漩涡後反而成了两头不是人。还有自以为已经搞懂了对方的意思可是却是听错话、会错的的可能喔，避免对别人的话太早下判断，而且要听到最後再来发表意见，别中途打岔後再来揣测了。', '0000-00-00 00:00:00');
INSERT INTO `xzysday` VALUES (7, '天秤座', '09/23 - 10/23', '2009-07-07', '3', '3', '2', '4', '<p>43%</p></div>', '<p>52%</p></div>', '<p>黄色</p></div>', '<p>5</p></div>', '<p>巨蟹座</p></div>', '运气於午後开始缓缓下滑的迹象。<br />\r午後就当作是充电时间吧，减少外出就对了。因为是体力上较易感到疲倦的一天，长途驾车的人需注意交通安全，提起精神专注前方，也别边开车边聊天。另外身体的抵抗力也较弱，尽量避免往人多拥挤的地方、空气不流通的地方去。', '0000-00-00 00:00:00');
INSERT INTO `xzysday` VALUES (8, '天蝎座', '10/24 - 11/22', '2009-07-07', '3', '4', '2', '3', '<p>62%</p></div>', '<p>58%</p></div>', '<p>浅蓝色</p></div>', '<p>2</p></div>', '<p>处女座</p></div>', '与朋友的交流对话中有著幸运存在。<br />\r任何的意见交换都对你是很珍贵的资料喔。不过今天应特别谨慎想到什麽做什麽的临时起意行动，通常都会伴随著相当的危险性。特别是别人的临时提议最好听听就好，不要轻易附和了。', '0000-00-00 00:00:00');
INSERT INTO `xzysday` VALUES (9, '射手座', '11/23 - 12/21', '2009-07-08', '3', '4', '3', '4', '<p>80%</p></div>', '<p>82%</p></div>', '<p>紫色</p></div>', '<p>5</p></div>', '<p>巨蟹座</p></div>', '今天尽可能与个性随和好相处的人一起行动。<br />\r对方带给别人的好印象让你也有在他人心目中加分的效果。自己的能力固然重要，找个好夥伴搭配也是很重要的一件事呢。还有什麽小小的好消息传来的暗示，像是朋友打来的电话啦、或是还没有尝试过的网路沟通工具倒是可以去尝鲜一下。', '0000-00-00 00:00:00');
INSERT INTO `xzysday` VALUES (10, '魔羯座', '12/22 - 01/19', '2009-07-07', '4', '4', '4', '3', '<p>86%</p></div>', '<p>70%</p></div>', '<p>深绿色</p></div>', '<p>3</p></div>', '<p>巨蟹座</p></div>', '今天的你似乎是担任为别人收尾、支援的角色。<br />\r别人的工作却也落到你的头上来。不过即使是有些被迫的意味，也要拿出你的大肚量尽量帮忙，今天为别人解决麻烦往後将会有受惠的一天呢。不过却不宜将这些事情带回家中，以免给家人添麻烦喔。', '0000-00-00 00:00:00');
INSERT INTO `xzysday` VALUES (11, '水瓶座', '01/20 - 02/18', '2009-07-08', '4', '4', '4', '2', '<p>71%</p></div>', '<p>89%</p></div>', '<p>金色</p></div>', '<p>6</p></div>', '<p>射手座</p></div>', '不仅自己能一整天都保持在兴奋的状态中，还会为了营造周围的气氛而努力。<br />\r偶尔当个小丑角色也无所谓啦，体验一下是愉快气氛制造者的角色也蛮有趣的。工作课业上也是轻轻松松得心应手的日子呢，不过身心开放的同时，钱包也不知不觉跟著打开了，玩乐的同时金钱预算可要控制好才行棉。', '0000-00-00 00:00:00');
INSERT INTO `xzysday` VALUES (12, '双鱼座', '02/19 - 03/20', '2009-07-08', '4', '3', '4', '4', '<p>92%</p></div>', '<p>85%</p></div>', '<p>白色</p></div>', '<p>3</p></div>', '<p>魔羯座</p></div>', '在个人兴趣与嗜好上受人注目，像是上演个人秀般活跃的一天。<br />\r周围的视线似乎都离不开你呢。当然在外表上就要多注重些了，出门前对自己的装扮再检查一遍，尤其是小地方像是指甲、鞋子等不要有肮脏的情况，今天的重要关键就是在这些小地方的清洁呢。', '0000-00-00 00:00:00');
