<?php
/*È¥³ıÊäÈë×Ö·ûÖĞµÄ¿Õ¸ñ---newtrimº¯Êı*/
function newtrim($str)
{
    $j=strlen($str);
    $result="";

    for($i=0; $i<$j; $i++) {
        switch($str[$i]) {
            case chr(8):
                # È¥µôÍË¸ñ
            case chr(9):
                # È¥µôtab
            case chr(10):
                # È¥µô»»ĞĞ
            case chr(13):
                # È¥µô»Ø³µ
            case chr(255):
                #È¥µôÌØÊâ¿Õ¸ñ
                break;
            default:
                $result .= $str[$i];
        }
    }
    return $result;
}


/*µÃµ½Ò»¸öºº×ÖµÄ±Ê»­Êı---getnum()º¯Êı*/
/** to be improved **/
function getnum($txt)
{
    $sql1="select * from bihua";
    $result = mysql_query($sql1);
    while($row=mysql_fetch_array($result)) {
        if(false !==strpos($row["hanzi"], $txt)) {
            return $row['num'];
        }
    }

    return 0;
}

/*ÓÉÌì¸ñ¡¢ÈË¸ñ¡¢µØ¸ñÊıµÃµ½Èı²Å---getsancai()º¯Êı*/
/** to be improved **/
/*function getsancai($tiange, $renge, $dige)
{
    $tian = $tiange%10;
    $ren = $renge%10;
    $di = $dige%10;
    switch($tian) {
        case 1:
        case 2:
            $tiantxt="Ä¾";
            break;
        case 3:
        case 4:
            $tiantxt="»ğ";
            break;
        case 5:
        case 6:
            $tiantxt="ÍÁ";
            break;
        case 7:
        case 8:
            $tiantxt="½ğ";
            break;
        case 9:
        case 10:
        case 0:
            $tiantxt="Ë®";
    }

    switch($ren) {
        case 1:
        case 2:
            $rentxt="Ä¾";
            break;
        case 3:
        case 4:
            $rentxt="»ğ";
            break;
        case 5:
        case 6:
            $rentxt="ÍÁ";
            break;
        case 7:
        case 8:
            $rentxt="½ğ";
            break;
        case 9:
        case 10:
        case 0:
            $rentxt="Ë®";
    }

    switch($di) {
        case 1:
        case 2:
            $ditxt="Ä¾";
            break;
        case 3:
        case 4:
            $ditxt="»ğ";
            break;
        case 5:
        case 6:
            $ditxt="ÍÁ";
            break;
        case 7:
        case 8:
            $ditxt="½ğ";
            break;
        case 9:
        case 10:
        case 0:
            $ditxt="Ë®";
    }

    $total = $tiantxt . $rentxt . $ditxt;
    return $total;
}
*/
/*'¹«Àú×ª»»Å©ÀúµÄËã·¨ edit by huanghui*/
function hhcal($caltime) 
{

    //»ñÈ¡µ±Ç°ÏµÍ³Ê±¼ä 
    $curTime = strtotime($caltime) ;
    //ĞÇÆÚÃû 
    $WeekName = array("ĞÇÆÚÈÕ", "ĞÇÆÚÒ»", "ĞÇÆÚ¶ş", "ĞÇÆÚÈı", "ĞÇÆÚËÄ", "ĞÇÆÚÎå" , "ĞÇÆÚÁù" );
    //Ìì¸ÉÃû³Æ 
    $TianGan = array("¼×", "ÒÒ", "±û" , "¶¡" , "Îì", "¼º", "¸ı", "ĞÁ", "ÈÉ", "¹ï");
    //µØÖ§Ãû³Æ 
    $DiZhi = array("×Ó", "³ó", "Òú", "Ã®", "³½", "ËÈ", "Îç", "Î´", "Éê", "ÓÏ", "Ğç", "º¥");
    //ÊôÏàÃû³Æ 
    $ShuXiang = array("Êó", "Å£", "»¢", "ÍÃ", "Áú", "Éß", "Âí", "Ñò", "ºï", "¼¦", "¹·", "Öí" );
    //Å©ÀúÈÕÆÚÃû 
    $DayName = array("*", "³õÒ»", "³õ¶ş" ,"³õÈı", "³õËÄ" , "³õÎå" , "³õÁù" , "³õÆß" , "³õ°Ë" , "³õ¾Å" , "³õÊ®" , "Ê®Ò»" , "Ê®¶ş" , "Ê®Èı" , "Ê®ËÄ" , "Ê®Îå" , "Ê®Áù" , "Ê®Æß" , "Ê®°Ë" , "Ê®¾Å" , "¶şÊ®" , "Ø¥Ò»" , "Ø¥¶ş", "Ø¥Èı", "Ø¥ËÄ" , "Ø¥Îå" , "Ø¥Áù" , "Ø¥Æß" , "Ø¥°Ë" , "Ø¥¾Å" , "ÈıÊ®" );
    //Å©ÀúÔÂ·İÃû 
    $MonName = array("*", "Õı", "¶ş", "Èı", "ËÄ", "Îå", "Áù", "Æß", "°Ë", "¾Å", "Ê®", "Ê®Ò»", "À°"); 
    //¹«ÀúÃ¿ÔÂÇ°ÃæµÄÌìÊı 
    $MonthAdd = array(0, 31, 59, 90, 120, 151, 181, 212, 243, 273, 304, 334); 
    //Å©ÀúÊı¾İ 
    $NongliData = array(2635 , 333387 , 1701 , 1748 , 267701 , 694 , 2391 , 133423 , 1175 , 396438 , 3402 , 3749 , 331177 , 1453 , 694 , 201326 , 2350 , 465197 , 3221 , 3402 , 400202 , 2901 , 1386 , 267611 , 605 , 2349 , 137515 , 2709 , 464533 , 1738 , 2901 , 330421 , 1242 , 2651 , 199255 , 1323 , 529706 , 3733 , 1706 , 398762 , 2741 , 1206 , 267438 , 2647 , 1318 , 204070 , 3477 , 461653 , 1386 , 2413 , 330077 , 1197 , 2637 , 268877 , 3365 , 531109 , 2900 , 2922 , 398042 , 2395 , 1179 , 267415 , 2635 , 661067 , 1701 , 1748 , 398772 , 2742 , 2391 , 330031 , 1175 , 1611 , 200010 , 3749 , 527717 , 1452 , 2742 , 332397 , 2350 , 3222 , 268949 , 3402 , 3493 , 133973 , 1386 , 464219 , 605 , 2349 , 334123 , 2709 , 2890 , 267946 , 2773 , 592565 , 1210 , 2651 , 395863 , 1323 , 2707 , 265877 );
    //Éú³Éµ±Ç°¹«ÀúÄê¡¢ÔÂ¡¢ÈÕ ==> GongliStr 
    $curYear = date("Y", $curTime); 
    $curMonth = date("n", $curTime) ;
    $curDay = date("j", $curTime) ;
    $GongliStr = $curYear . "Äê" . $curMonth . "ÔÂ" . $curDay . "ÈÕ";

    //Éú³Éµ±Ç°¹«ÀúĞÇÆÚ ==> WeekdayStr 
    $curWeekday = date('w', $curTime) ;
    $WeekdayStr = $WeekName[$curWeekday]; 

    //¼ÆËãµ½³õÊ¼Ê±¼ä1921Äê2ÔÂ8ÈÕµÄÌìÊı£º1921-2-8(ÕıÔÂ³õÒ») 
    $TheDate = ($curYear - 1921) * 365 + intval(($curYear - 1921) / 4) + $curDay + $MonthAdd[intval($curMonth) - 1] - 38 ;
    if (($curYear%4) == 0 && $curMonth > 2){ 
        $TheDate = $TheDate + 1;
    }

    //¼ÆËãÅ©ÀúÌì¸É¡¢µØÖ§¡¢ÔÂ¡¢ÈÕ 
    $isEnd = 0 ;
    $m = 0 ;
    do{ 
        if ($NongliData[$m] < 4095) { 
            $k = 11 ;
     } else {
            $k = 12 ;
     } 
        $n = $k ;
        do{ 
            if ($n < 0) { 
                break;
      } 
            //»ñÈ¡NongliData(m)µÄµÚn¸ö¶ş½øÖÆÎ»µÄÖµ 
            $bit = $NongliData[$m]; 
            for($i=0; $i<$n; $i++) { 
                $bit = intval($bit / 2);
         } 
            $bit = $bit%2; 
            if ($TheDate <= 29 + $bit){ 
                $isEnd = 1 ;
                break;
            }
            $TheDate = $TheDate - 29 - $bit; 
            $n--;
     } while (true);

        if ($isEnd == 1) { 
            break;
     } 
        $m++;
    } while (true);
    $curYear = 1921 + $m ;
    $curMonth = $k - $n + 1 ;
    $curDay = $TheDate ;
    if ($k == 12) {
        if ($curMonth == intval($NongliData[$m] / 65536) + 1) { 
            $curMonth = 1 - $curMonth ;
        }
        elseif ($curMonth > intval($NongliData[$m] / 65536) + 1) { 
            $curMonth = $curMonth - 1 ;
        }
    }

    //Éú³ÉÅ©ÀúÌì¸É¡¢µØÖ§¡¢ÊôÏà ==> NongliStr
    $nlnian = $TianGan[((($curYear - 4)%60)%10)] . $DiZhi[((($curYear - 4)%60)%12)];
    $sx = $ShuXiang[((($curYear - 4)%60)%12)];
    //Éú³ÉÅ©ÀúÔÂ¡¢ÈÕ ==> NongliDayStr 
    if ($curMonth < 1) { 
        $nlyue = $MonName[-1 * $curMonth] ;
    }
    else  {
        $nlyue = $MonName[$curMonth]; 
    }
    $nlri = $DayName[$curDay];
    $nonglistr= $nlnian . "|" . $nlyue . "|" . $nlri . "|" . $sx;
    return $nonglistr;
}

function Constellation($mDate)
{
    $time = strtotime($mDate);
    if(false===$time) {
        echo "·ÇÈÕÆÚ";
        return;
    }
    $a= date("j", $time) - (19 + intval(substr("102123444423", date("n", $time)-1, 1)));
    $a = $a>=0? 0:-1;

    //'ĞÇ×ù
    $Constellation = substr("Ä§ôÉË®Æ¿Ë«Óã°×Ñò½ğÅ£Ë«×Ó¾ŞĞ·Ê¨×Ó´¦Å®Ìì³ÓÌìĞ«ÉäÊÖÄ§ôÉ", (date("n", $time) + $a)*4 , 4) . "×ù" ;
    return $Constellation;
}


/*Ìæ»»»»ĞĞ·ûµÄ¹ıÂËº¯Êı*/
function rep($content)
{
    return str_replace(array("\n", "\r\n"), "<br>", $content);
}

function GbToBig($content)
{
    $s="Ñô,°¨,°ª,°­,°®,°¿,°À,°Â,°Ó,°Õ,°Ú,°Ü,°ä,°ì,°í,°ï,°ó,°÷,°ù,°ş,±¥,±¦,±¨,±«,±²,±´,±µ,±·,±¸,±¹,±Á,±Ê,±Ï,±Ğ,±Õ,±ß,±à,±á,±ä,±ç,±è,±î,±ñ,±ô,±õ,±ö,±÷,±ı,²¦,²§,²¬,²µ,²·,²¹,²Î,²Ï,²Ğ,²Ñ,²Ò,²Ó,²Ô,²Õ,²Ö,²×,²Ş,²à,²á,²â,²ã,²ï,²ó,²ô,²õ,²ö,²÷,²ø,²ù,²ú,²û,²ü,³¡,³¢,³¤,³¥,³¦,³§,³©,³®,³µ,³¹,³¾,³Â,³Ä,³Å,³Æ,³Í,³Ï,³Ò,³Õ,³Ù,³Û,³Ü,³İ,³ã,³å,³æ,³è,³ë,³ì,³ï,³ñ,³ó,³÷,³ø,³ú,³û,´¡,´¢,´¥,´¦,´«,´¯,´³,´´,´¸,´¿,´Â,´Ç,´Ê,´Í,´Ï,´Ğ,´Ñ,´Ó,´Ô,´Õ,´Ü,´í,´ï,´ø,´û,µ£,µ¥,µ¦,µ§,µ¨,µ¬,µ®,µ¯,µ±,µ²,µ³,µ´,µµ,µ·,µº,µ»,µ¼,µÁ,µÆ,µË,µĞ,µÓ,µİ,µŞ,µã,µæ,µç,µí,µö,µ÷,µü,µı,µş,¶¤,¶¥,¶§,¶©,¶«,¶¯,¶°,¶³,¶·,¶¿,¶À,¶Á,¶Ä,¶Æ,¶Í,¶Ï,¶Ğ,¶Ò,¶Ó,¶Ô,¶Ö,¶Ù,¶Û,¶á,¶ì,¶î,¶ï,¶ñ,¶ö,¶ù,¶û,¶ü,·¡,·¢,·£,·§,·©,·¯,·°,·³,·¶,··,·¹,·Ã,·Ä,·É,·Ï,·Ñ,·×,·Ø,·Ü,·ß,·à,·á,·ã,·æ,·ç,·è,·ë,·ì,·í,·ï,·ô,·ø,¸§,¸¨,¸³,¸´,¸º,¸¼,¸¾,¸¿,¸Ã,¸Æ,¸Ç,¸É,¸Ï,¸Ñ,¸Ó,¸Ô,¸Õ,¸Ö,¸Ù,¸Ú,¸Ş,¸ä,¸é,¸ë,¸ó,¸õ,¸ö,¸ø,¹¨,¹¬,¹®,¹±,¹³,¹µ,¹¹,¹º,¹»,¹Æ,¹Ë,¹Ğ,¹Ø,¹Û,¹İ,¹ß,¹á,¹ã,¹æ,¹è,¹é,¹ê,¹ë,¹ì,¹î,¹ñ,¹ó,¹ô,¹õ,¹ö,¹ø,¹ú,¹ı,º§,º«,ºº,ºÒ,º×,ºØ,ºá,ºä,ºè,ºì,ºó,ºø,»¤,»¦,»§,»©,»ª,»­,»®,»°,»³,»µ,»¶,»·,»¹,»º,»»,»½,»¾,»À,»Á,»Æ,»Ñ,»Ó,»Ô,»Ù,»ß,»à,»á,»â,»ã,»ä,»å,»æ,»ç,»ë,»ï,»ñ,»õ,»ö,»÷,»ú,»ı,¼¢,¼¥,¼¦,¼¨,¼©,¼«,¼­,¼¶,¼·,¼¸,¼»,¼Á,¼Ã,¼Æ,¼Ç,¼Ê,¼Ì,¼Í,¼Ğ,¼Ô,¼Õ,¼Ö,¼Ø,¼Û,¼İ,¼ß,¼à,¼á,¼ã,¼ä,¼è,¼ê,¼ë,¼ì,¼î,¼ï,¼ğ,¼ñ,¼ò,¼ó,¼õ,¼ö,¼÷,¼ø,¼ù,¼ú,¼û,¼ü,½¢,½£,½¤,½¥,½¦,½§,½¬,½¯,½°,½±,½²,½´,½º,½½,½¾,½¿,½Á,½Â,½Ã,½Ä,½Å,½È,½É,½Ê,½Î,½Ï,½Õ,½×,½Ú,¾¥,¾ª,¾­,¾±,¾²,¾µ,¾¶,¾·,¾º,¾»,¾À,¾Ç,¾É,¾Ô,¾Ù,¾İ,¾â,¾å,¾ç,¾é,¾î,½Ü,½à,½á,½ë,½ì,½ô,½õ,½ö,½÷,½ø,½ú,½ı,¾¡,¾¢,¾£,¾õ,¾ö,¾÷,¾ø,¾û,¾ü,¿¥,¿ª,¿­,¿Å,¿Ç,¿Î,¿Ñ,¿Ò,¿Ù,¿â,¿ã,¿ä,¿é,¿ë,¿í,¿ó,¿õ,¿ö,¿÷,¿ù,¿ú,À¡,À£,À©,À«,À¯,À°,À³,À´,Àµ,À¶,À¸,À¹,Àº,À»,À¼,À½,À¾,À¿,ÀÀ,ÀÁ,ÀÂ,ÀÃ,ÀÄ,ÀÌ,ÀÍ,ÀÔ,ÀÖ,ÀØ,Àİ,Àà,Àá,Àé,Àë,Àï,Àğ,Àñ,Àö,À÷,Àø,Àù,Àú,Á¤,Á¥,Á©,Áª,Á«,Á¬,Á­,Á¯,Á°,Á±,Á²,Á³,Á´,Áµ,Á¶,Á·,Á¸,Á¹,Á½,Á¾,ÁÂ,ÁÆ,ÁÉ,ÁÍ,ÁÔ,ÁÙ,ÁÚ,ÁÛ,Áİ,ÁŞ,Áä,Áå,Áè,Áé,Áë,Áì,Áó,Áõ,Áú,Áû,Áü,Áı,Â¢,Â£,Â¤,Â¥,Â¦,Â§,Â¨,Â«,Â¬,Â­,Â®,Â¯,Â°,Â±,Â²,Â³,Â¸,Â»,Â¼,Â½,Â¿,ÂÀ,ÂÁ,ÂÂ,ÂÅ,ÂÆ,ÂÇ,ÂË,ÂÌ,ÂÍ,ÂÎ,ÂÏ,ÂĞ,ÂÒ,ÂÕ,ÂÖ,Â×,ÂØ,ÂÙ,ÂÚ,ÂÛ,ÂÜ,ÂŞ,Âß,Âà,Âá,Ââ,Âæ,Âç,Âè,Âê,Âë,Âì,Âí,Âî,Âğ,Âò,Âó,Âô,Âõ,Âö,Â÷,Âø,Âù,Âú,Ã¡,Ã¨,Ãª,Ã­,Ã³,Ã´,Ã¹,Ã»,Ã¾,ÃÅ,ÃÆ,ÃÇ,ÃÌ,ÃÎ,ÃÕ,ÃÖ,ÃÙ,Ãà,Ãå,Ãí,Ãğ,Ãõ,Ãö,Ãù,Ãú,Ãı,Ä±,Ä¶,ÄÆ,ÄÉ,ÄÑ,ÄÓ,ÄÔ,ÄÕ,ÄÖ,ÄÙ,Äå,Äì,Äí,Äğ,Äñ,Äô,Äö,Ä÷,Äø,Äû,Äü,Äş,Å¡,Å¢,Å¥,Å¦,Å§,Å¨,Å©,Å±,Åµ,Å·,Å¸,Å¹,Å»,Å½,ÅÌ,ÅÓ,¹ú,°®,Åâ,Åç,Åô,Æ­,Æ®,Æµ,Æ¶,Æ»,Æ¾,ÆÀ,ÆÃ,ÆÄ,ÆË,ÆÌ,ÆÓ,Æ×,Æê,Æë,Æï,Æñ,Æô,Æø,Æú,Æı,Ç£,Ç¤,Ç¥,Ç¦,Ç¨,Ç©,Ç«,Ç®,Ç¯,Ç±,Ç³,Ç´,Çµ,Ç¹,Çº,Ç½,Ç¾,Ç¿,ÇÀ,ÇÂ,ÇÅ,ÇÇ,ÇÈ,ÇÌ,ÇÏ,ÇÔ,ÇÕ,Ç×,Çá,Çâ,Çã,Çê,Çë,Çì,Çí,Çî,Ç÷,Çø,Çû,Çı,È£,È§,È¨,È°,È´,Èµ,ÈÃ,ÈÄ,ÈÅ,ÈÆ,ÈÈ,ÈÍ,ÈÏ,ÈÒ,ÈÙ,ÈŞ,Èí,Èñ,Èò,Èó,È÷,Èø,Èú,Èü,É¡,É¥,É§,É¨,É¬,É±,É´,É¸,É¹,ÉÁ,ÉÂ,ÉÄ,ÉÉ,ÉË,ÉÍ,ÉÕ,ÉÜ,ÉŞ,Éã,Éå,Éè,Éğ,Éó,Éô,Éö,Éø,Éù,Éş,Ê¤,Ê¥,Ê¦,Ê¨,Êª,Ê«,Ê¬,Ê±,Ê´,Êµ,Ê¶,Ê»,ÊÆ,ÊÍ,ÊÎ,ÊÓ,ÊÔ,ÊÙ,ÊŞ,Êà,Êä,Êé,Êê,Êô,Êõ,Ê÷,Êú,Êı,Ë§,Ë«,Ë­,Ë°,Ë³,Ëµ,Ë¶,Ë¸,Ë¿,ËÇ,ËÊ,ËË,ËÌ,ËÏ,ËĞ,ËÓ,ËÕ,Ëß,Ëà,Ëä,Ëç,Ëê,Ëï,Ëğ,Ëñ,Ëõ,Ëö,Ëø,Ì¡,Ì¢,Ì§,Ì¯,Ì°,Ì±,Ì²,Ì³,Ì·,Ì¸,Ì¾,ÌÀ,ÌÌ,ÌÎ,ÌĞ,ÌÚ,ÌÜ,Ìà,Ìâ,Ìå,Ìë,Ìõ,Ìù,Ìú,Ìü,Ìı,Ìş,Í­,Í³,Í·,Í¼,Í¿,ÍÅ,ÍÇ,ÍÉ,ÍÑ,ÍÒ,ÍÔ,ÍÕ,ÍÖ,Íİ,Íà,Íä,Íå,Íç,Íò,Íø,Î¤,Î¥,Î§,Îª,Î«,Î¬,Î­,Î°,Î±,Î³,Î½,ÎÀ,ÎÂ,ÎÅ,ÎÆ,ÎÈ,ÎÊ,ÎÍ,ÎÎ,ÎÏ,ÎĞ,ÎÑ,ÎØ,ÎÙ,ÎÚ,ÎÜ,ÎŞ,Îß,Îâ,Îë,Îí,Îñ,Îó,Îı,Îş,Ï®,Ï°,Ï³,Ï·,Ï¸,Ïº,Ï½,Ï¿,ÏÀ,ÏÁ,ÏÃ,ÏÇ,ÏÊ,ÏË,ÏÌ,ÏÍ,ÏÎ,ÏĞ,ÏÔ,ÏÕ,ÏÖ,Ï×,ÏØ,ÏÚ,ÏÛ,ÏÜ,Ïß,Ïá,Ïâ,Ïç,Ïê,Ïì,Ïî,Ïô,Ïú,Ïş,Ğ¥,Ğ«,Ğ­,Ğ®,Ğ¯,Ğ²,Ğ³,Ğ´,Ğº,Ğ»,Ğ¿,ĞÆ,ĞË,ĞÚ,Ğâ,Ğå,Ğé,Ğê,Ğë,Ğí,Ğ÷,Ğø,Ğù,Ğü,Ñ¡,Ñ¢,Ñ¤,Ñ§,Ñ«,Ñ¯,Ñ°,Ñ±,Ñµ,Ñ¶,Ñ·,Ñ¹,Ñ»,Ñ¼,ÑÆ,ÑÇ,ÑÈ,ÑË,ÑÌ,ÑÎ,ÑÏ,ÑÕ,ÑÖ,ÑŞ,Ñá,Ñâ,Ñå,Ñè,Ñé,Ñì,Ñî,Ñï,Ññ,Ñ÷,Ñø,Ñù,Ñş,Ò¡,Ò¢,Ò£,Ò¤,Ò¥,Ò©,Ò¯,Ò³,Òµ,Ò¶,Ò½,Ò¿,ÒÃ,ÒÅ,ÒÇ,ÒÍ,ÒÏ,ÒÕ,ÒÚ,Òä,Òå,Òè,Òé,Òê,Òë,Òì,Òï,Òñ,Òõ,Òø,Òû,Ó£,Ó¤,Ó¥,Ó¦,Ó§,Ó¨,Ó©,Óª,Ó«,Ó¬,Ó±,Ó´,Óµ,Ó¶,Ó¸,Ó»,Ó½,Ó¿,ÓÅ,ÓÇ,ÓÊ,ÓË,ÓÌ,ÓÎ,ÓÕ,Óß,Óã,Óæ,Óé,Óë,Óì,Óï,Óõ,Óù,Óü,Óş,Ô¤,Ô¦,Ô§,Ô¨,Ô¯,Ô°,Ô±,Ô²,Ôµ,Ô¶,Ô¸,Ô¼,Ô¾,Ô¿,ÔÀ,ÔÁ,ÔÃ,ÔÄ,ÔÆ,ÔÇ,ÔÈ,ÔÉ,ÔË,ÔÌ,ÔÍ,ÔÎ,ÔÏ,ÔÓ,ÔÖ,ÔØ,ÔÜ,Ôİ,ÔŞ,Ôß,Ôà,Ôä,Ôæ,Ôî,Ôğ,Ôñ,Ôò,Ôó,Ôô,Ôù,Ôú,Ôı,Ôş,Õ¡,Õ¢,Õ©,Õ«,Õ®,Õ±,Õµ,Õ¶,Õ·,Õ¸,Õ»,Õ½,ÕÀ,ÕÅ,ÕÇ,ÕÊ,ÕË,ÕÍ,ÕÔ,Õİ,ÕŞ,Õà,Õâ,Õê,Õë,Õì,Õï,Õò,Õó,Õõ,Õö,Õø,Ö¡,Ö£,Ö¤,Ö¯,Ö°,Ö´,Ö½,Ö¿,ÖÀ,ÖÄ,ÖÊ,ÖÓ,ÖÕ,ÖÖ,Ö×,ÖÚ,Öß,Öá,Öå,Öç,Öè,Öí,Öî,Öï,Öò,Öõ,Öö,Öü,Öı,Öş,×¤,×¨,×©,×ª,×¬,×®,×¯,×°,×±,×³,×´,×¶,×¸,×¹,×º,×»,×Ç,×È,×Ê,×Õ,×Ù,×Û,×Ü,×İ,×Ş,×ç,×é,×ê,ÖÂ,ÖÓ,Ã´,Îª,Ö»,Ğ×,×¼,Æô,°å,Àï,ö¨,Óà,Á´,Ğ¹";

    $t="ê–,°},Ì@,µK,Û,ÂO,Ò\,ŠW,‰Î,ÁT,”[,”¡,îC,Şk,½O,Í,½‰,æ^,Ör,„ƒ,ï–,Œš,ˆó,õU,İ…,Ø,ä^,ªN,‚ä,‘v,¿‡,¹P,®…,”À,é],ß…,¾,ÙH,×ƒ,Şq,Şp,ü‚,°T,l,I,Ùe,”P,ï,“Ü,À,ãK,ñg,ÊN,Ña,…¢,ĞQ,šˆ,‘M,‘K, N,Én,Å“,‚},œæ,ú,‚È,ƒÔ,œy,ŒÓ,ÔŒ,”v,“½,Ïs,ğ’,×‹,Àp,çP,®b,êU,î,ˆö,‡L,éL,ƒ”,Äc,S,•³,ân,Ü‡,Ø,‰m,ê,Òr,“Î,·Q,‘Í,Õ\,òG,°V,ßt,ñY,u,ıX,Ÿë,›_,Ïx,Œ™,® ,ÜP,»I,¾I,áh,™»,N,äz,ër,µA,ƒ¦,Ó|,Ì,‚÷,¯,êJ,„“,åN,¼ƒ,¾b,Şo,Ô~,Ùn,Â”,Ê[,‡è,Ä,…²,œ,¸Z,åe,ß_,§,ÙJ,“ú,†Î,à,“Û,Ä‘,‘„,ÕQ,—,®”,“õ,üh,Ê,™n,“v,u,¶\,Œ§,±I,Ÿô,à‡,”³,œì,ßf,¾†,üc,‰|,ëŠ,Õ,á,Õ{,µş,Õ™,¯B,á”,í”,åV,Ó†,–|,„Ó,—,ƒö,ôY, Ù,ªš,×x,Ù€,åƒ,å‘,”à,¾„,ƒ¶,ê ,Œ¦,‡,îD,âg,ŠZ,ùZ,î~,Ó,º,ğI,ƒº, –,ğD,ÙE,°l,ÁP,éy,¬m,µ\,âC,Ÿ©,¹ ,Øœ,ïˆ,ÔL,¼,ïw,U,ÙM,¼Š,‰,Š^,‘,¼S,ØS,—÷,äh,ïL,¯‚,ñT,¿p,ÖS,øP,Äw,İ—,“á,İo,Ùx,Ñ},Ø“,Ó‡,‹D,¿`,Ô“,â},Éw,Ö,Ús,¶’,ÚM,Œù,„‚,ä“,¾V,,ÅV,æ€,”R,ø,éw,ãt,‚€,½o,ı,Œm,ì–,Ø•,âh,œÏ,˜‹,Ù,‰ò,ĞM,î™,„,êP,Ó^,ğ^,‘T,Ø,V,Ò,Îù,šw,ı”,é|,Ü‰,Ô,™™,ÙF,„£,İ,L,å,‡ø,ß^,ñ”,ín,h,éu,úQ,ÙR,™M,ŞZ,ø™,¼t,áá,‰Ø,×o,œû,‘ô,‡W,ÈA,®‹,„,Ô’,‘Ñ,‰Ä,šg,­h,ß€,¾,“Q,†¾,¯ˆ,Ÿ¨,œo,üS,Öe,“],İx,š§,ÙV,·x,•ş, Z,¡,ÖM,Õd,ÀL,È,œ†,â·,«@,Ø›,µœ,“ô,™C,·e,ğ‡,×I,ëu,¿ƒ,¾ƒ,˜O,İ‹,¼‰,”D,×,ËE,„©,ú,Ó‹,Ó›,ëH,À^,¼o,ŠA,Çv,îa,ÙZ,â›,ƒr,ñ{,š,±O,ˆÔ,¹{,ég,ÆD,¾},ÀO,™z,‰A,û|,’ş,“ì,º†,ƒ€,œp,Ë],™‘,èb,Û`,Ùv,ÒŠ,æI,Å,„¦,ğT,u,R,¾,{,ÊY,˜ª,ª„,Öv,áu,Äz,²,òœ,‹É,”‡,ãq,³C,ƒe,Ä_,ïœ,ÀU,½g,ŞI,İ^,·M,ëA,¹,Ço,ó@,½›,îi,ìo,çR,½,¯d,¸‚,œQ,¼m,ı,Åf,ñx,Åe,“ş,ä,‘Ö,„¡,ùN,½,‚Ü,,½Y,Õ],ŒÃ,¾o,å\,ƒH,Ö”,ßM,•x, a,±M,„Å,ÇG,ÓX,›Q,ÔE,½^,âx,ÜŠ,òE,é_,„P,îw,š¤,Õn,‰¨,‘©,“¸,ì,Ñ,ÕF,‰K,ƒ~,Œ’,µV,•ç,›r,Ì,h,¸Q,ğ,¢,”U,éŸ,Ï,ÅD,ÈR,í,Ù‡,Ë{,™Ú,”r,»@,ê@,Ìm,‘,×,”ˆ,Ó[,‘Ğ,À|, €,E,“Æ,„Ú,³,˜·,èD,‰¾,î,œI,»h,ëx,ÑY,õ,¶Y,û,…–,„î,µ[,•Ñ,r,ë`,‚z,Â“,É,ßB,ç ,‘z,i,ºŸ,”¿,Ä˜,æœ,‘Ù,Ÿ’,¾š,¼Z,›ö,ƒÉ,İv,Õ,¯Ÿ,ß|,ç‚,«C,ÅR,à,÷[,„C,ÙU,ıg,â,œR,ì`,X,îI,ğs,„¢,ıˆ,Ã@,‡µ,»\,‰Å,”n,ë],˜Ç,Šä,“§,ºt,ÌJ,±R,ïB,], t,“ï,ûu,Ì”,ô”,ÙT,µ“,ä›,ê‘,óH,…Î,äX,‚H,ŒÒ,¿|,‘],V,¾G,n,”,Œ\,´,y,’à,İ†,‚,ö,œS,¾],Õ“,Ì},Á_,ß‰,èŒ,»j,ò…,ñ˜,½j,‹Œ,¬”,´a,Î›,ñR,ÁR,†á,ÙI,ûœ,Ùu,ß~,Ã},²m,ğz,ĞU,M,Ö™,Øˆ,å^,ãT,ÙQ,÷á,üq,›],æV,éT,,‚ƒ,åi,‰ô,Öi,›,Ò’,¾d,¾’,R,œç,‘‘,é},øQ,ã‘,Ö‡,Ö\,®€,âc,¼{,ëy,“Ï,ÄX,À,ô[,ğH,Ä,”f,“Ó,á„,øB,Â™,ım,è‡,æ‡,™,ªŸ,å¸,”Q,ô,âo,¼~,Ä“,â,Şr,¯‘,ÖZ,šW,út,šª,‡I,a,±P,ı‹,‡ø,Û,Ùr,‡Š,ùi,ò_,ïh,îl,Øš,ÌO,‘{,Ôu,Š,îH,“ä,ä,˜ã,×V,Äš,ıR,òT,ØM,†™,šâ,—‰,Ó™, ¿,’L,âT,ãU,ßw,º,Öt,åX,ãQ,“,œ\,×l,‰q,˜Œ,†Ü, ,ËN,Š,“Œ,æ@,˜ò,†Ì,ƒS,ÂN,¸[,¸`,šJ,ÓH,İp,šä,ƒA,í•,Õˆ,‘c,­‚,¸F,Ú…,…^,Ü|,òŒ,ıx,ïE,™à,„ñ,…s,ùo,×Œ,ğˆ,”_,À@,Ÿá,íg,ÕJ,¼x,˜s,½q,Ü›,äJ,éc,™,¢,Ë_,öw,Ù,‚ã,†Ê,ò},’ß,­,š¢,¼†,ºY,•ñ,éW,ê„,Ù ,¿˜,‚û,Ùp,Ÿı,½B,Ùd,”z,‘Ø,ÔO,¼,Œ,‹ğ,ÄI,B,Â•,ÀK,„Ù,Â},Ÿ,ª{,ñ,ÔŠ,ŒÆ,•r,Îg,Œ,×R,ñ‚,„İ,áŒ,ï—,Ò•,Ô‡,‰Û,«F,˜Ğ,İ”,•ø,ÚH,ŒÙ,Ğg,˜ä,ØQ,”µ,›,ëp,Õl,¶,í˜,Õf,´T, q,½z,ï•,Â–,‘Z,í,ÔA,Õb,”\,ÌK,ÔV,ÃC,ëm,½—,šq,ŒO,“p,¹S,¿s,¬,æi,«H,“é,”E,”‚,Ø,°c,©,‰¯,×T,Õ„,šU,œ«, C,ı,¿l,òv,Ö`,äR,î},ów,ŒÏ,—l,ÙN,èF,d,Â ,ŸN,ã~,½y,î^,ˆD,‰T,ˆF,îj,Í‘,Ã“,ør,ñW,ñ„,™E,¸D,Òm,,³,îB,Èf,¾W,íf,ß`,‡ú, ‘,H,¾S,È”,‚¥,ƒ^,¾•,Ö^,Ğl,œØ,Â„,¼y,·€,†–,®Y,“ë,Î,œu,¸C,†è,æu,õ,Õ_,Ÿo,Ê,…Ç,‰],ìF,„Õ,Õ`,åa, Ş,Òu,Á•,ãŠ,‘ò,¼š,Îr,İ ,{,‚b,ªM,B,åv,õr,Àw,ûy,Ùt,ã•,ée,ï@,ëU,¬F,«I,¿h,ğW,Áw,‘—,¾€,û,è‚,àl,Ô”,í‘,í—,Ê’,äN,•Ô,‡[,Ï,…f,’¶,”y,Ã{,ÖC,Œ‘,a,Öx,ä\,á…,Åd,›°,çn,ÀC,Ì“,‡u,íš,ÔS,¾w,Àm,Ü,‘Ò,ßx,°_,½k,ŒW,„ì,Ôƒ,Œ¤,ñZ,Ó–,Ó,ßd,‰º,øf,ø†,†¡,†,Ó ,é,ŸŸ,û},‡À,î†,é,ØW,…’,³,©,ÖV,ò,ø„,—î,“P,¯ƒ,°W,ğB,˜Ó,¬,“u,ˆò,ßb,¸G,Ö{,Ë, ”,í“,˜I,È~,át,ã,îU,ßz,ƒx,¤,Ï,Ë‡,ƒ|,‘›,Áx,Ô„,×h,Õx,×g,®,À[,Êa,ê,ãy,ï‹,™Ñ,‹ë,ú—,‘ª,Àt,¬“,Î, I,ŸÉ,Ï‰,·f,†Ñ,“í,‚ò,°b,Ûx,Ô,œ¥,ƒ,‘n,à],â™,ªq,ß[,ÕT,İ›,ô~,O,ŠÊ,Åc,Z,ÕZ,»n,¶R,ªz,×u,îA,ñS,øx,œY,Ş@,ˆ@,†T,ˆA,¾‰,ßh,îŠ,¼s,ÜS,è€,[,»›,‚,é†,ë…,ày,„ò,ëE,ß\,ÌN,áj,•,í,ës,Ä,İd,”€,•º,Ù,ÚE,óv,è,——,¸^,ØŸ,“ñ,„t,É,Ù\,Ù›,¼™,„,Üˆ,å,él,Ôp,ıS,‚ù,šÖ,±K,”Ø,İš,ä,—£,‘ğ,¾`,ˆ,q,¤,Ù~,Ã›,Úw,ÏU,ŞH,æN,ß@,Ø‘,á˜,‚É,Ô\,æ‚,ê‡,’ê,± ,ªb,¬,à,×C,¿—,Âš,ˆÌ,¼ˆ,“´,”S,Ã,Ù|,æR,½K,·N,Ä[,Ğ\,Öa,İS,°™,•ƒ,óE,Øi,ÖT,ÕD, T,²š,‡Ú,ÙA,èT,ºB,ñv,Œ£,´u,ŞD,Ù,˜¶,Çf,Ñb,Šy,‰Ñ, î,åF,Ù˜,‰‹,¾Y,Õ,á,Æ,ÙY,n,Û™,¾C,¿‚,¿v,àu,Ô{,½M,è,¿@,çŠ,üN,é,ëb,ƒ´,œÊ,†¢,é›,Ñe,ìZ,ğN,å€,›ª";

    $s=explode(",", $s);
    $t=explode(",", $t);
    $content=str_replace($s, $t, $content);

    return $content;
}


/*µÃµ½Ò»¸öºº×Ö×ÖÒâÎåĞĞ*/
function getzywh($txt)
{
    $sql1="select * from hzwh";
    $rs1=mysql_query($sql1);
    while($row=mysql_fetch_array($rs1)){
        if(false!==strpos($row["hz"], $txt)) {
            return $row["wh"];
        }
    }
	   
    return '';
}

function getsancai($sc)
{
    $sc=$sc%10;
    switch($sc){
        case 1:
        case 2:
            $sctxt="Ä¾";
        break;
        case 3:
        case 4:
            $sctxt="»ğ";
        break;
        case 5:
        case 6:
            $sctxt="ÍÁ";
        break;
        case 7:
        case 8:
            $sctxt="½ğ";
        break;
        case 9:
        case 10:
        case 0:
            $sctxt="Ë®";
        break;
    }

    return $sctxt;
}

function DiZhi($i)
{
    $arr = array("×Ó", "³ó","³ó","Òú","Òú","Ã®","Ã®","³½","³½","ËÈ","ËÈ","Îç","Îç","Î´","Î´","Éê","Éê","ÓÏ","ÓÏ","Ğç","Ğç","º¥","º¥","×Ó");
    return $arr[$i];
}


function getpf($sc)
{
    $arr = array("´ó¼ª" =>12, "¼ª"=>8, "°ë¼ª"=>5, "´óĞ×"=> 0, "Ğ×"=> 1, "°ëĞ×"=> 2, "Æ½"=>4);
    return $arr[$sc];
}

/*ÄÉÒô*/
function layin($tgdz)
{
    $sql1="select * from jiazi";
    $rs1=mysql_query($sql1);
    while($row=mysql_fetch_array($rs1)){
        if(false!==strpos($row["jiazi"], $tgdz)) {
            return $row["layin"];
        }
    }
	   
    return '';
}

function tgdzwh($tgdz)
{
    $arr = array("×Ó" => "Ë®"
                ,"º¥" => "Ë®"
                ,"Òú" => "Ä¾"
                ,"Ã®" => "Ä¾"
                ,"ËÈ" => "»ğ"
                ,"Îç" => "»ğ"
                ,"Éê" => "½ğ"
                ,"ÓÏ" => "½ğ"
                ,"³½" => "ÍÁ"
                ,"Ğç" => "ÍÁ"
                ,"³ó" => "ÍÁ"
                ,"Î´" => "ÍÁ"
                ,"¼×" => "Ä¾"
                ,"ÒÒ" => "Ä¾"
                ,"±û" => "»ğ"
                ,"¶¡" => "»ğ"
                ,"Îì" => "ÍÁ"
                ,"¼º" => "ÍÁ"
                ,"¸ı" => "½ğ"
                ,"ĞÁ" => "½ğ"
                ,"ÈÉ" => "Ë®"
                ,"¹ï" => "Ë®"
                );
    return $arr[$tgdz];
}

function siji($yue)
{
    $arr = array ("1" => "¶¬"
                    ,"2" => "¶¬"
                    ,"3" => "´º"
                    ,"4" => "´º"
                    ,"5" => "´º"
                    ,"6" => "ÏÄ"
                    ,"7" => "ÏÄ"
                    ,"8" => "ÏÄ"
                    ,"9" => "Çï"
                    ,"10" => "Çï"
                    ,"11" => "Çï"
                    ,"12" => "¶¬");
    return $arr[$yue];
} 


function g($num)
{
    static $d = array(
        "a" => -20319 
        ,"ai" => -20317 
        ,"an" => -20304 
        ,"ang" => -20295 
        ,"ao" => -20292 
        ,"ba" => -20283 
        ,"bai" => -20265 
        ,"ban" => -20257 
        ,"bang" => -20242 
        ,"bao" => -20230 
        ,"bei" => -20051 
        ,"ben" => -20036 
        ,"beng" => -20032 
        ,"bi" => -20026 
        ,"bian" => -20002 
        ,"biao" => -19990 
        ,"bie" => -19986 
        ,"bin" => -19982 
        ,"bing" => -19976 
        ,"bo" => -19805 
        ,"bu" => -19784 
        ,"ca" => -19775 
        ,"cai" => -19774 
        ,"can" => -19763 
        ,"cang" => -19756 
        ,"cao" => -19751 
        ,"ce" => -19746 
        ,"ceng" => -19741 
        ,"cha" => -19739 
        ,"chai" => -19728 
        ,"chan" => -19725 
        ,"chang" => -19715 
        ,"chao" => -19540 
        ,"che" => -19531 
        ,"chen" => -19525 
        ,"cheng" => -19515 
        ,"chi" => -19500 
        ,"chong" => -19484 
        ,"chou" => -19479 
        ,"chu" => -19467 
        ,"chuai" => -19289 
        ,"chuan" => -19288 
        ,"chuang" => -19281 
        ,"chui" => -19275 
        ,"chun" => -19270 
        ,"chuo" => -19263 
        ,"ci" => -19261 
        ,"cong" => -19249 
        ,"cou" => -19243 
        ,"cu" => -19242 
        ,"cuan" => -19238 
        ,"cui" => -19235 
        ,"cun" => -19227 
        ,"cuo" => -19224 
        ,"da" => -19218 
        ,"dai" => -19212 
        ,"dan" => -19038 
        ,"dang" => -19023 
        ,"dao" => -19018 
        ,"de" => -19006 
        ,"deng" => -19003 
        ,"di" => -18996 
        ,"dian" => -18977 
        ,"diao" => -18961 
        ,"die" => -18952 
        ,"ding" => -18783 
        ,"diu" => -18774 
        ,"dong" => -18773 
        ,"dou" => -18763 
        ,"du" => -18756 
        ,"duan" => -18741 
        ,"dui" => -18735 
        ,"dun" => -18731 
        ,"duo" => -18722 
        ,"e" => -18710 
        ,"en" => -18697 
        ,"er" => -18696 
        ,"fa" => -18526 
        ,"fan" => -18518 
        ,"fang" => -18501 
        ,"fei" => -18490 
        ,"fen" => -18478 
        ,"feng" => -18463 
        ,"fo" => -18448 
        ,"fou" => -18447 
        ,"fu" => -18446 
        ,"ga" => -18239 
        ,"gai" => -18237 
        ,"gan" => -18231 
        ,"gang" => -18220 
        ,"gao" => -18211 
        ,"ge" => -18201 
        ,"gei" => -18184 
        ,"gen" => -18183 
        ,"geng" => -18181 
        ,"gong" => -18012 
        ,"gou" => -17997 
        ,"gu" => -17988 
        ,"gua" => -17970 
        ,"guai" => -17964 
        ,"guan" => -17961 
        ,"guang" => -17950 
        ,"gui" => -17947 
        ,"gun" => -17931 
        ,"guo" => -17928 
        ,"ha" => -17922 
        ,"hai" => -17759 
        ,"han" => -17752 
        ,"hang" => -17733 
        ,"hao" => -17730 
        ,"he" => -17721 
        ,"hei" => -17703 
        ,"hen" => -17701 
        ,"heng" => -17697 
        ,"hong" => -17692 
        ,"hou" => -17683 
        ,"hu" => -17676 
        ,"hua" => -17496 
        ,"huai" => -17487 
        ,"huan" => -17482 
        ,"huang" => -17468 
        ,"hui" => -17454 
        ,"hun" => -17433 
        ,"huo" => -17427 
        ,"ji" => -17417 
        ,"jia" => -17202 
        ,"jian" => -17185 
        ,"jiang" => -16983 
        ,"jiao" => -16970 
        ,"jie" => -16942 
        ,"jin" => -16915 
        ,"jing" => -16733 
        ,"jiong" => -16708 
        ,"jiu" => -16706 
        ,"ju" => -16689 
        ,"juan" => -16664 
        ,"jue" => -16657 
        ,"jun" => -16647 
        ,"ka" => -16474 
        ,"kai" => -16470 
        ,"kan" => -16465 
        ,"kang" => -16459 
        ,"kao" => -16452 
        ,"ke" => -16448 
        ,"ken" => -16433 
        ,"keng" => -16429 
        ,"kong" => -16427 
        ,"kou" => -16423 
        ,"ku" => -16419 
        ,"kua" => -16412 
        ,"kuai" => -16407 
        ,"kuan" => -16403 
        ,"kuang" => -16401 
        ,"kui" => -16393 
        ,"kun" => -16220 
        ,"kuo" => -16216 
        ,"la" => -16212 
        ,"lai" => -16205 
        ,"lan" => -16202 
        ,"lang" => -16187 
        ,"lao" => -16180 
        ,"le" => -16171 
        ,"lei" => -16169 
        ,"leng" => -16158 
        ,"li" => -16155 
        ,"lia" => -15959 
        ,"lian" => -15958 
        ,"liang" => -15944 
        ,"liao" => -15933 
        ,"lie" => -15920 
        ,"lin" => -15915 
        ,"ling" => -15903 
        ,"liu" => -15889 
        ,"long" => -15878 
        ,"lou" => -15707 
        ,"lu" => -15701 
        ,"lv" => -15681 
        ,"luan" => -15667 
        ,"lue" => -15661 
        ,"lun" => -15659 
        ,"luo" => -15652 
        ,"ma" => -15640 
        ,"mai" => -15631 
        ,"man" => -15625 
        ,"mang" => -15454 
        ,"mao" => -15448 
        ,"me" => -15436 
        ,"mei" => -15435 
        ,"men" => -15419 
        ,"meng" => -15416 
        ,"mi" => -15408 
        ,"mian" => -15394 
        ,"miao" => -15385 
        ,"mie" => -15377 
        ,"min" => -15375 
        ,"ming" => -15369 
        ,"miu" => -15363 
        ,"mo" => -15362 
        ,"mou" => -15183 
        ,"mu" => -15180 
        ,"na" => -15165 
        ,"nai" => -15158 
        ,"nan" => -15153 
        ,"nang" => -15150 
        ,"nao" => -15149 
        ,"ne" => -15144 
        ,"nei" => -15143 
        ,"nen" => -15141 
        ,"neng" => -15140 
        ,"ni" => -15139 
        ,"nian" => -15128 
        ,"niang" => -15121 
        ,"niao" => -15119 
        ,"nie" => -15117 
        ,"nin" => -15110 
        ,"ning" => -15109 
        ,"niu" => -14941 
        ,"nong" => -14937 
        ,"nu" => -14933 
        ,"nv" => -14930 
        ,"nuan" => -14929 
        ,"nue" => -14928 
        ,"nuo" => -14926 
        ,"o" => -14922 
        ,"ou" => -14921 
        ,"pa" => -14914 
        ,"pai" => -14908 
        ,"pan" => -14902 
        ,"pang" => -14894 
        ,"pao" => -14889 
        ,"pei" => -14882 
        ,"pen" => -14873 
        ,"peng" => -14871 
        ,"pi" => -14857 
        ,"pian" => -14678 
        ,"piao" => -14674 
        ,"pie" => -14670 
        ,"pin" => -14668 
        ,"ping" => -14663 
        ,"po" => -14654 
        ,"pu" => -14645 
        ,"qi" => -14630
        ,"qia" => -14594 
        ,"qian" => -14429 
        ,"qiang" => -14407 
        ,"qiao" => -14399 
        ,"qie" => -14384 
        ,"qin" => -14379 
        ,"qing" => -14368 
        ,"qiong" => -14355 
        ,"qiu" => -14353 
        ,"qu" => -14345 
        ,"quan" => -14170 
        ,"que" => -14159 
        ,"qun" => -14151 
        ,"ran" => -14149 
        ,"rang" => -14145 
        ,"rao" => -14140 
        ,"re" => -14137 
        ,"ren" => -14135 
        ,"reng" => -14125 
        ,"ri" => -14123 
        ,"rong" => -14122 
        ,"rou" => -14112 
        ,"ru" => -14109 
        ,"ruan" => -14099 
        ,"rui" => -14097 
        ,"run" => -14094 
        ,"ruo" => -14092 
        ,"sa" => -14090 
        ,"sai" => -14087 
        ,"san" => -14083 
        ,"sang" => -13917 
        ,"sao" => -13914 
        ,"se" => -13910 
        ,"sen" => -13907 
        ,"seng" => -13906 
        ,"sha" => -13905 
        ,"shai" => -13896 
        ,"shan" => -13894 
        ,"shang" => -13878 
        ,"shao" => -13870 
        ,"she" => -13859 
        ,"shen" => -13847 
        ,"sheng" => -13831 
        ,"shi" => -13658 
        ,"shou" => -13611 
        ,"shu" => -13601 
        ,"shua" => -13406 
        ,"shuai" => -13404 
        ,"shuan" => -13400 
        ,"shuang" => -13398 
        ,"shui" => -13395 
        ,"shun" => -13391 
        ,"shuo" => -13387 
        ,"si" => -13383 
        ,"song" => -13367 
        ,"sou" => -13359 
        ,"su" => -13356 
        ,"suan" => -13343 
        ,"sui" => -13340 
        ,"sun" => -13329 
        ,"suo" => -13326 
        ,"ta" => -13318 
        ,"tai" => -13147 
        ,"tan" => -13138 
        ,"tang" => -13120 
        ,"tao" => -13107 
        ,"te" => -13096 
        ,"teng" => -13095 
        ,"ti" => -13091 
        ,"tian" => -13076 
        ,"tiao" => -13068 
        ,"tie" => -13063 
        ,"ting" => -13060 
        ,"tong" => -12888 
        ,"tou" => -12875 
        ,"tu" => -12871 
        ,"tuan" => -12860 
        ,"tui" => -12858 
        ,"tun" => -12852 
        ,"tuo" => -12849 
        ,"wa" => -12838 
        ,"wai" => -12831 
        ,"wan" => -12829 
        ,"wang" => -12812 
        ,"wei" => -12802 
        ,"wen" => -12607 
        ,"weng" => -12597 
        ,"wo" => -12594 
        ,"wu" => -12585 
        ,"xi" => -12556 
        ,"xia" => -12359 
        ,"xian" => -12346 
        ,"xiang" => -12320 
        ,"xiao" => -12300 
        ,"xie" => -12120 
        ,"xin" => -12099 
        ,"xing" => -12089 
        ,"xiong" => -12074 
        ,"xiu" => -12067 
        ,"xu" => -12058 
        ,"xuan" => -12039 
        ,"xue" => -11867 
        ,"xun" => -11861 
        ,"ya" => -11847 
        ,"yan" => -11831 
        ,"yang" => -11798 
        ,"yao" => -11781 
        ,"ye" => -11604 
        ,"yi" => -11589 
        ,"yin" => -11536 
        ,"ying" => -11358 
        ,"yo" => -11340 
        ,"yong" => -11339 
        ,"you" => -11324 
        ,"yu" => -11303 
        ,"yuan" => -11097 
        ,"yue" => -11077 
        ,"yun" => -11067 
        ,"za" => -11055 
        ,"zai" => -11052 
        ,"zan" => -11045 
        ,"zang" => -11041 
        ,"zao" => -11038 
        ,"ze" => -11024 
        ,"zei" => -11020 
        ,"zen" => -11019 
        ,"zeng" => -11018 
        ,"zha" => -11014 
        ,"zhai" => -10838 
        ,"zhan" => -10832 
        ,"zhang" => -10815 
        ,"zhao" => -10800 
        ,"zhe" => -10790 
        ,"zhen" => -10780 
        ,"zheng" => -10764 
        ,"zhi" => -10587 
        ,"zhong" => -10544 
        ,"zhou" => -10533 
        ,"zhu" => -10519 
        ,"zhua" => -10331 
        ,"zhuai" => -10329 
        ,"zhuan" => -10328 
        ,"zhuang" => -10322 
        ,"zhui" => -10315 
        ,"zhun" => -10309 
        ,"zhuo" => -10307 
        ,"zi" => -10296 
        ,"zong" => -10281 
        ,"zou" => -10274 
        ,"zu" => -10270 
        ,"zuan" => -10262 
        ,"zui" => -10260 
        ,"zun" => -10256 
        ,"zuo" => -10254 );

    $aa = array_values($d);
    $b = array_keys($d);

    if($num>0 && $num<160) {
        return chr($num);
    }
    if($num<-20319 || $num>-10247){
        return '';
    }
    $k=count($aa);
    while($k--){
        if($aa[$k]<=$num){
            break;
        }
    }
    return $b[$k];
}

function c($str)
{
    $c="" ;

    $strLen = strlen($str);
    for($k=0; $k<$strLen; $k++){
        $charCode = ord(substr($str, $k, 1));
        if($charCode>=0x80 && $charCode<=0xFF) {
            $charLowCode = ord(substr($str, ++$k, 1));
            $charCode = $charCode*256 + $charLowCode - 65536;

        }
        $c .= g($charCode); 
    }
    return $c;
}


//Ğ´Èëcookies---writecookies()
function writecookies()
{
	if (count($_POST)) {
		$xing=newtrim($_REQUEST['xing']);
		$ming=newtrim($_REQUEST['ming']);
		$xingbie=newtrim($_REQUEST['xingbie']);
		$xuexing=newtrim($_REQUEST['xuexing']);
		//¹«Àú
		$nian1=newtrim($_REQUEST['nian']);
		$yue1=newtrim($_REQUEST['yue']);
		$ri1=newtrim($_REQUEST['ri']);
		$hh1=newtrim($_REQUEST['hh']);
		$mm1=newtrim($_REQUEST['mm']);
		//Å©Àú
		$glstr= $nian1 . "-" . $yue1 . "-" . $ri1;
		$nlstr=hhcal($glstr);
		$nlarray=explode('|' , $nlstr);
		$nlnian=$nlarray[0];
		$nlyue=$nlarray[1];
		$nlri=$nlarray[2];
		$sx=$nlarray[3];

		$cookieExpire = time()+3600;
		setcookie ('laisuanming[xing]', $xing , $cookieExpire, '/');
		setcookie ('laisuanming[ming]', $ming , $cookieExpire, '/');
		setcookie ('laisuanming[xingbie]', $xingbie , $cookieExpire, '/');
		setcookie ('laisuanming[xuexing]', $xuexing , $cookieExpire, '/');
		//¹«Àú
		setcookie ('laisuanming[nian1]', $nian1 , $cookieExpire, '/');
		setcookie ('laisuanming[yue1]', $yue1 , $cookieExpire, '/');
		setcookie ('laisuanming[ri1]', $ri1 , $cookieExpire, '/');
		setcookie ('laisuanming[hh1]', $hh1 , $cookieExpire, '/');
		setcookie ('laisuanming[mm1]', $mm1 , $cookieExpire, '/');
		//Å©Àú
		setcookie ('laisuanming[nian2]', $nlnian , $cookieExpire, '/');
		setcookie ('laisuanming[yue2]', $nlyue , $cookieExpire, '/');
		setcookie ('laisuanming[ri2]', $nlri , $cookieExpire, '/');
		setcookie ('laisuanming[hh2]', $hh1 , $cookieExpire, '/');
		setcookie ('laisuanming[mm2]', $mm1 , $cookieExpire, '/');
		setcookie ('laisuanming[sx]', $sx , $cookieExpire, '/');

  $_COOKIE['laisuanming']['xing'] = $xing;
		$_COOKIE['laisuanming']['ming'] = $ming;
		$_COOKIE['laisuanming']['xingbie'] = $xingbie;
		$_COOKIE['laisuanming']['xuexing'] = $xuexing;
		//¹«Àú
		$_COOKIE['laisuanming']['nian1'] = $nian1;
		$_COOKIE['laisuanming']['yue1'] = $yue1;
		$_COOKIE['laisuanming']['ri1'] = $ri1;
		$_COOKIE['laisuanming']['hh1'] = $hh1;
		$_COOKIE['laisuanming']['mm1'] = $mm1;
		//Å©Àú
		$_COOKIE['laisuanming']['nian2'] = $nlnian;
		$_COOKIE['laisuanming']['yue2'] = $nlyue;
		$_COOKIE['laisuanming']['ri2'] = $nlri;
		$_COOKIE['laisuanming']['hh2'] = $hh1;
		$_COOKIE['laisuanming']['mm2'] = $mm1;
		$_COOKIE['laisuanming']['sx'] = $sx;
	}
}


//Çå³ıcookies---clearcookies()
function clearcookies()
{
	 $cookieExpire = time()-3600;
		setcookie ('laisuanming[xing]', '' , $cookieExpire, '/');
		setcookie ('laisuanming[ming]', '' , $cookieExpire, '/');
		setcookie ('laisuanming[xingbie]', '' , $cookieExpire, '/');
		setcookie ('laisuanming[xuexing]', '' , $cookieExpire, '/');
		//¹«Àú
		setcookie ('laisuanming[nian1]', '' , $cookieExpire, '/');
		setcookie ('laisuanming[yue1]', '' , $cookieExpire, '/');
		setcookie ('laisuanming[ri1]', '' , $cookieExpire, '/');
		setcookie ('laisuanming[hh1]', '' , $cookieExpire, '/');
		setcookie ('laisuanming[mm1]', '' , $cookieExpire, '/');
		//Å©Àú
		setcookie ('laisuanming[nian2]', '' , $cookieExpire, '/');
		setcookie ('laisuanming[yue2]', '' , $cookieExpire, '/');
		setcookie ('laisuanming[ri2]', '' , $cookieExpire, '/');
		setcookie ('laisuanming[hh2]', '' , $cookieExpire, '/');
		setcookie ('laisuanming[mm2]', '' , $cookieExpire, '/');
		setcookie ('laisuanming[sx]', '' , $cookieExpire, '/');
  setcookie ('laisuanming', '' , $cookieExpire, '/');
}

/**
$pingyin = '';
for($i=0; $i<strlen($str); $i+=2) {
    $pinyin = g(substr($str, $i, 2));
    if($pinyin=='') {
        echo substr($str, $i, 2);
    } 
    if($pinyin!=$pingyin) {
        echo $pinyin . "\n";
        $pingyin = $pinyin;
    }
}
**/
